Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x6d4 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 16 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x9f6e1): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x1115e8): ../Core/Src/gpio.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xf5ec7): /home/ducnt/workspace/h753duc/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 2
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : (indirect string, offset: 0x8f449): short int
 <1><31>: Abbrev Number: 2 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 6	(signed char)
    <34>   DW_AT_name        : (indirect string, offset: 0x12b186): signed char
 <1><38>: Abbrev Number: 5 (DW_TAG_typedef)
    <39>   DW_AT_name        : (indirect string, offset: 0xbab0d): __uint8_t
    <3d>   DW_AT_decl_file   : 2
    <3e>   DW_AT_decl_line   : 43
    <3f>   DW_AT_decl_column : 24
    <40>   DW_AT_type        : <0x44>
 <1><44>: Abbrev Number: 2 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 1
    <46>   DW_AT_encoding    : 8	(unsigned char)
    <47>   DW_AT_name        : (indirect string, offset: 0xaded0): unsigned char
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x5719): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 2 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x6113f): short unsigned int
 <1><5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x12a380): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x1404d0): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 2 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x9fda8): long unsigned int
 <1><78>: Abbrev Number: 2 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x9a4e): long long int
 <1><7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0xb0db2): long long unsigned int
 <1><86>: Abbrev Number: 17 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 2 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x9f6d4): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0xbab0f): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x38>
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x571b): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x1404d2): uint32_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 10 (DW_TAG_array_type)
    <be>   DW_AT_type        : <0xac>
    <c2>   DW_AT_sibling     : <0xcd>
 <2><c6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c7>   DW_AT_type        : <0x8d>
    <cb>   DW_AT_upper_bound : 3
 <2><cc>: Abbrev Number: 0
 <1><cd>: Abbrev Number: 10 (DW_TAG_array_type)
    <ce>   DW_AT_type        : <0xb8>
    <d2>   DW_AT_sibling     : <0xdd>
 <2><d6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <d7>   DW_AT_type        : <0x8d>
    <db>   DW_AT_upper_bound : 1
 <2><dc>: Abbrev Number: 0
 <1><dd>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <de>   DW_AT_type        : <0xcd>
 <1><e2>: Abbrev Number: 10 (DW_TAG_array_type)
    <e3>   DW_AT_type        : <0xac>
    <e7>   DW_AT_sibling     : <0xf2>
 <2><eb>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <ec>   DW_AT_type        : <0x8d>
    <f0>   DW_AT_upper_bound : 8
 <2><f1>: Abbrev Number: 0
 <1><f2>: Abbrev Number: 18 (DW_TAG_structure_type)
    <f3>   DW_AT_byte_size   : 40
    <f4>   DW_AT_decl_file   : 4
    <f5>   DW_AT_decl_line   : 1026
    <f7>   DW_AT_decl_column : 9
    <f8>   DW_AT_sibling     : <0x172>
 <2><fc>: Abbrev Number: 1 (DW_TAG_member)
    <fd>   DW_AT_name        : (indirect string, offset: 0x14256c): MODER
    <101>   DW_AT_decl_file   : 4
    <101>   DW_AT_decl_line   : 1028
    <103>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xb8>
    <108>   DW_AT_data_member_location: 0
 <2><109>: Abbrev Number: 1 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x12f7be): OTYPER
    <10e>   DW_AT_decl_file   : 4
    <10e>   DW_AT_decl_line   : 1029
    <110>   DW_AT_decl_column : 17
    <111>   DW_AT_type        : <0xb8>
    <115>   DW_AT_data_member_location: 4
 <2><116>: Abbrev Number: 1 (DW_TAG_member)
    <117>   DW_AT_name        : (indirect string, offset: 0xfd4ff): OSPEEDR
    <11b>   DW_AT_decl_file   : 4
    <11b>   DW_AT_decl_line   : 1030
    <11d>   DW_AT_decl_column : 17
    <11e>   DW_AT_type        : <0xb8>
    <122>   DW_AT_data_member_location: 8
 <2><123>: Abbrev Number: 1 (DW_TAG_member)
    <124>   DW_AT_name        : (indirect string, offset: 0x14938b): PUPDR
    <128>   DW_AT_decl_file   : 4
    <128>   DW_AT_decl_line   : 1031
    <12a>   DW_AT_decl_column : 17
    <12b>   DW_AT_type        : <0xb8>
    <12f>   DW_AT_data_member_location: 12
 <2><130>: Abbrev Number: 7 (DW_TAG_member)
    <131>   DW_AT_name        : IDR
    <135>   DW_AT_decl_file   : 4
    <135>   DW_AT_decl_line   : 1032
    <137>   DW_AT_decl_column : 17
    <138>   DW_AT_type        : <0xb8>
    <13c>   DW_AT_data_member_location: 16
 <2><13d>: Abbrev Number: 7 (DW_TAG_member)
    <13e>   DW_AT_name        : ODR
    <142>   DW_AT_decl_file   : 4
    <142>   DW_AT_decl_line   : 1033
    <144>   DW_AT_decl_column : 17
    <145>   DW_AT_type        : <0xb8>
    <149>   DW_AT_data_member_location: 20
 <2><14a>: Abbrev Number: 1 (DW_TAG_member)
    <14b>   DW_AT_name        : (indirect string, offset: 0x3ba8c): BSRR
    <14f>   DW_AT_decl_file   : 4
    <14f>   DW_AT_decl_line   : 1034
    <151>   DW_AT_decl_column : 17
    <152>   DW_AT_type        : <0xb8>
    <156>   DW_AT_data_member_location: 24
 <2><157>: Abbrev Number: 1 (DW_TAG_member)
    <158>   DW_AT_name        : (indirect string, offset: 0x145494): LCKR
    <15c>   DW_AT_decl_file   : 4
    <15c>   DW_AT_decl_line   : 1035
    <15e>   DW_AT_decl_column : 17
    <15f>   DW_AT_type        : <0xb8>
    <163>   DW_AT_data_member_location: 28
 <2><164>: Abbrev Number: 7 (DW_TAG_member)
    <165>   DW_AT_name        : AFR
    <169>   DW_AT_decl_file   : 4
    <169>   DW_AT_decl_line   : 1036
    <16b>   DW_AT_decl_column : 17
    <16c>   DW_AT_type        : <0xdd>
    <170>   DW_AT_data_member_location: 32
 <2><171>: Abbrev Number: 0
 <1><172>: Abbrev Number: 13 (DW_TAG_typedef)
    <173>   DW_AT_name        : (indirect string, offset: 0x97cc9): GPIO_TypeDef
    <177>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 1037
    <179>   DW_AT_decl_column : 3
    <179>   DW_AT_type        : <0xf2>
 <1><17d>: Abbrev Number: 19 (DW_TAG_structure_type)
    <17e>   DW_AT_byte_size   : 304
    <180>   DW_AT_decl_file   : 4
    <181>   DW_AT_decl_line   : 1230
    <183>   DW_AT_decl_column : 9
    <184>   DW_AT_sibling     : <0x4de>
 <2><188>: Abbrev Number: 7 (DW_TAG_member)
    <189>   DW_AT_name        : CR
    <18c>   DW_AT_decl_file   : 4
    <18c>   DW_AT_decl_line   : 1232
    <18e>   DW_AT_decl_column : 16
    <18f>   DW_AT_type        : <0xb8>
    <193>   DW_AT_data_member_location: 0
 <2><194>: Abbrev Number: 1 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x30af): HSICFGR
    <199>   DW_AT_decl_file   : 4
    <199>   DW_AT_decl_line   : 1233
    <19b>   DW_AT_decl_column : 16
    <19c>   DW_AT_type        : <0xb8>
    <1a0>   DW_AT_data_member_location: 4
 <2><1a1>: Abbrev Number: 1 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x2f3bd): CRRCR
    <1a6>   DW_AT_decl_file   : 4
    <1a6>   DW_AT_decl_line   : 1234
    <1a8>   DW_AT_decl_column : 16
    <1a9>   DW_AT_type        : <0xb8>
    <1ad>   DW_AT_data_member_location: 8
 <2><1ae>: Abbrev Number: 1 (DW_TAG_member)
    <1af>   DW_AT_name        : (indirect string, offset: 0xb8aee): CSICFGR
    <1b3>   DW_AT_decl_file   : 4
    <1b3>   DW_AT_decl_line   : 1235
    <1b5>   DW_AT_decl_column : 16
    <1b6>   DW_AT_type        : <0xb8>
    <1ba>   DW_AT_data_member_location: 12
 <2><1bb>: Abbrev Number: 1 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x15a4fa): CFGR
    <1c0>   DW_AT_decl_file   : 4
    <1c0>   DW_AT_decl_line   : 1236
    <1c2>   DW_AT_decl_column : 16
    <1c3>   DW_AT_type        : <0xb8>
    <1c7>   DW_AT_data_member_location: 16
 <2><1c8>: Abbrev Number: 1 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x67af6): RESERVED1
    <1cd>   DW_AT_decl_file   : 4
    <1cd>   DW_AT_decl_line   : 1237
    <1cf>   DW_AT_decl_column : 15
    <1d0>   DW_AT_type        : <0xac>
    <1d4>   DW_AT_data_member_location: 20
 <2><1d5>: Abbrev Number: 1 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x15a4f8): D1CFGR
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 1238
    <1dc>   DW_AT_decl_column : 16
    <1dd>   DW_AT_type        : <0xb8>
    <1e1>   DW_AT_data_member_location: 24
 <2><1e2>: Abbrev Number: 1 (DW_TAG_member)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x497ad): D2CFGR
    <1e7>   DW_AT_decl_file   : 4
    <1e7>   DW_AT_decl_line   : 1239
    <1e9>   DW_AT_decl_column : 16
    <1ea>   DW_AT_type        : <0xb8>
    <1ee>   DW_AT_data_member_location: 28
 <2><1ef>: Abbrev Number: 1 (DW_TAG_member)
    <1f0>   DW_AT_name        : (indirect string, offset: 0x237bb): D3CFGR
    <1f4>   DW_AT_decl_file   : 4
    <1f4>   DW_AT_decl_line   : 1240
    <1f6>   DW_AT_decl_column : 16
    <1f7>   DW_AT_type        : <0xb8>
    <1fb>   DW_AT_data_member_location: 32
 <2><1fc>: Abbrev Number: 1 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0xb72da): RESERVED2
    <201>   DW_AT_decl_file   : 4
    <201>   DW_AT_decl_line   : 1241
    <203>   DW_AT_decl_column : 15
    <204>   DW_AT_type        : <0xac>
    <208>   DW_AT_data_member_location: 36
 <2><209>: Abbrev Number: 1 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x4632): PLLCKSELR
    <20e>   DW_AT_decl_file   : 4
    <20e>   DW_AT_decl_line   : 1242
    <210>   DW_AT_decl_column : 16
    <211>   DW_AT_type        : <0xb8>
    <215>   DW_AT_data_member_location: 40
 <2><216>: Abbrev Number: 1 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0x1fb6b): PLLCFGR
    <21b>   DW_AT_decl_file   : 4
    <21b>   DW_AT_decl_line   : 1243
    <21d>   DW_AT_decl_column : 16
    <21e>   DW_AT_type        : <0xb8>
    <222>   DW_AT_data_member_location: 44
 <2><223>: Abbrev Number: 1 (DW_TAG_member)
    <224>   DW_AT_name        : (indirect string, offset: 0x3d0a1): PLL1DIVR
    <228>   DW_AT_decl_file   : 4
    <228>   DW_AT_decl_line   : 1244
    <22a>   DW_AT_decl_column : 16
    <22b>   DW_AT_type        : <0xb8>
    <22f>   DW_AT_data_member_location: 48
 <2><230>: Abbrev Number: 1 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0xc45fe): PLL1FRACR
    <235>   DW_AT_decl_file   : 4
    <235>   DW_AT_decl_line   : 1245
    <237>   DW_AT_decl_column : 16
    <238>   DW_AT_type        : <0xb8>
    <23c>   DW_AT_data_member_location: 52
 <2><23d>: Abbrev Number: 1 (DW_TAG_member)
    <23e>   DW_AT_name        : (indirect string, offset: 0x11285e): PLL2DIVR
    <242>   DW_AT_decl_file   : 4
    <242>   DW_AT_decl_line   : 1246
    <244>   DW_AT_decl_column : 16
    <245>   DW_AT_type        : <0xb8>
    <249>   DW_AT_data_member_location: 56
 <2><24a>: Abbrev Number: 1 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x115331): PLL2FRACR
    <24f>   DW_AT_decl_file   : 4
    <24f>   DW_AT_decl_line   : 1247
    <251>   DW_AT_decl_column : 16
    <252>   DW_AT_type        : <0xb8>
    <256>   DW_AT_data_member_location: 60
 <2><257>: Abbrev Number: 1 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0x75122): PLL3DIVR
    <25c>   DW_AT_decl_file   : 4
    <25c>   DW_AT_decl_line   : 1248
    <25e>   DW_AT_decl_column : 16
    <25f>   DW_AT_type        : <0xb8>
    <263>   DW_AT_data_member_location: 64
 <2><264>: Abbrev Number: 1 (DW_TAG_member)
    <265>   DW_AT_name        : (indirect string, offset: 0xbd4eb): PLL3FRACR
    <269>   DW_AT_decl_file   : 4
    <269>   DW_AT_decl_line   : 1249
    <26b>   DW_AT_decl_column : 16
    <26c>   DW_AT_type        : <0xb8>
    <270>   DW_AT_data_member_location: 68
 <2><271>: Abbrev Number: 1 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x107658): RESERVED3
    <276>   DW_AT_decl_file   : 4
    <276>   DW_AT_decl_line   : 1250
    <278>   DW_AT_decl_column : 16
    <279>   DW_AT_type        : <0xac>
    <27d>   DW_AT_data_member_location: 72
 <2><27e>: Abbrev Number: 1 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0x1e620): D1CCIPR
    <283>   DW_AT_decl_file   : 4
    <283>   DW_AT_decl_line   : 1251
    <285>   DW_AT_decl_column : 17
    <286>   DW_AT_type        : <0xb8>
    <28a>   DW_AT_data_member_location: 76
 <2><28b>: Abbrev Number: 1 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x134b4): D2CCIP1R
    <290>   DW_AT_decl_file   : 4
    <290>   DW_AT_decl_line   : 1252
    <292>   DW_AT_decl_column : 17
    <293>   DW_AT_type        : <0xb8>
    <297>   DW_AT_data_member_location: 80
 <2><298>: Abbrev Number: 1 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x139b7): D2CCIP2R
    <29d>   DW_AT_decl_file   : 4
    <29d>   DW_AT_decl_line   : 1253
    <29f>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xb8>
    <2a4>   DW_AT_data_member_location: 84
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x405f5): D3CCIPR
    <2aa>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 1254
    <2ac>   DW_AT_decl_column : 17
    <2ad>   DW_AT_type        : <0xb8>
    <2b1>   DW_AT_data_member_location: 88
 <2><2b2>: Abbrev Number: 1 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x67b48): RESERVED4
    <2b7>   DW_AT_decl_file   : 4
    <2b7>   DW_AT_decl_line   : 1255
    <2b9>   DW_AT_decl_column : 16
    <2ba>   DW_AT_type        : <0xac>
    <2be>   DW_AT_data_member_location: 92
 <2><2bf>: Abbrev Number: 1 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x157c2): CIER
    <2c4>   DW_AT_decl_file   : 4
    <2c4>   DW_AT_decl_line   : 1256
    <2c6>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0xb8>
    <2cb>   DW_AT_data_member_location: 96
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x15deb): CIFR
    <2d1>   DW_AT_decl_file   : 4
    <2d1>   DW_AT_decl_line   : 1257
    <2d3>   DW_AT_decl_column : 17
    <2d4>   DW_AT_type        : <0xb8>
    <2d8>   DW_AT_data_member_location: 100
 <2><2d9>: Abbrev Number: 1 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x14b75): CICR
    <2de>   DW_AT_decl_file   : 4
    <2de>   DW_AT_decl_line   : 1258
    <2e0>   DW_AT_decl_column : 17
    <2e1>   DW_AT_type        : <0xb8>
    <2e5>   DW_AT_data_member_location: 104
 <2><2e6>: Abbrev Number: 1 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x67b52): RESERVED5
    <2eb>   DW_AT_decl_file   : 4
    <2eb>   DW_AT_decl_line   : 1259
    <2ed>   DW_AT_decl_column : 15
    <2ee>   DW_AT_type        : <0xac>
    <2f2>   DW_AT_data_member_location: 108
 <2><2f3>: Abbrev Number: 1 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x2c5b1): BDCR
    <2f8>   DW_AT_decl_file   : 4
    <2f8>   DW_AT_decl_line   : 1260
    <2fa>   DW_AT_decl_column : 17
    <2fb>   DW_AT_type        : <0xb8>
    <2ff>   DW_AT_data_member_location: 112
 <2><300>: Abbrev Number: 7 (DW_TAG_member)
    <301>   DW_AT_name        : CSR
    <305>   DW_AT_decl_file   : 4
    <305>   DW_AT_decl_line   : 1261
    <307>   DW_AT_decl_column : 17
    <308>   DW_AT_type        : <0xb8>
    <30c>   DW_AT_data_member_location: 116
 <2><30d>: Abbrev Number: 1 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0x67b5c): RESERVED6
    <312>   DW_AT_decl_file   : 4
    <312>   DW_AT_decl_line   : 1262
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0xac>
    <319>   DW_AT_data_member_location: 120
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xd664): AHB3RSTR
    <31f>   DW_AT_decl_file   : 4
    <31f>   DW_AT_decl_line   : 1263
    <321>   DW_AT_decl_column : 16
    <322>   DW_AT_type        : <0xb8>
    <326>   DW_AT_data_member_location: 124
 <2><327>: Abbrev Number: 1 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0x1446d1): AHB1RSTR
    <32c>   DW_AT_decl_file   : 4
    <32c>   DW_AT_decl_line   : 1264
    <32e>   DW_AT_decl_column : 16
    <32f>   DW_AT_type        : <0xb8>
    <333>   DW_AT_data_member_location: 128
 <2><334>: Abbrev Number: 1 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0x70678): AHB2RSTR
    <339>   DW_AT_decl_file   : 4
    <339>   DW_AT_decl_line   : 1265
    <33b>   DW_AT_decl_column : 16
    <33c>   DW_AT_type        : <0xb8>
    <340>   DW_AT_data_member_location: 132
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0xbf92c): AHB4RSTR
    <346>   DW_AT_decl_file   : 4
    <346>   DW_AT_decl_line   : 1266
    <348>   DW_AT_decl_column : 16
    <349>   DW_AT_type        : <0xb8>
    <34d>   DW_AT_data_member_location: 136
 <2><34e>: Abbrev Number: 1 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x2ecf0): APB3RSTR
    <353>   DW_AT_decl_file   : 4
    <353>   DW_AT_decl_line   : 1267
    <355>   DW_AT_decl_column : 16
    <356>   DW_AT_type        : <0xb8>
    <35a>   DW_AT_data_member_location: 140
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x8cf10): APB1LRSTR
    <360>   DW_AT_decl_file   : 4
    <360>   DW_AT_decl_line   : 1268
    <362>   DW_AT_decl_column : 16
    <363>   DW_AT_type        : <0xb8>
    <367>   DW_AT_data_member_location: 144
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x5fc3e): APB1HRSTR
    <36d>   DW_AT_decl_file   : 4
    <36d>   DW_AT_decl_line   : 1269
    <36f>   DW_AT_decl_column : 16
    <370>   DW_AT_type        : <0xb8>
    <374>   DW_AT_data_member_location: 148
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0x1254c4): APB2RSTR
    <37a>   DW_AT_decl_file   : 4
    <37a>   DW_AT_decl_line   : 1270
    <37c>   DW_AT_decl_column : 16
    <37d>   DW_AT_type        : <0xb8>
    <381>   DW_AT_data_member_location: 152
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x148875): APB4RSTR
    <387>   DW_AT_decl_file   : 4
    <387>   DW_AT_decl_line   : 1271
    <389>   DW_AT_decl_column : 16
    <38a>   DW_AT_type        : <0xb8>
    <38e>   DW_AT_data_member_location: 156
 <2><38f>: Abbrev Number: 7 (DW_TAG_member)
    <390>   DW_AT_name        : GCR
    <394>   DW_AT_decl_file   : 4
    <394>   DW_AT_decl_line   : 1272
    <396>   DW_AT_decl_column : 16
    <397>   DW_AT_type        : <0xb8>
    <39b>   DW_AT_data_member_location: 160
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x67b66): RESERVED8
    <3a1>   DW_AT_decl_file   : 4
    <3a1>   DW_AT_decl_line   : 1273
    <3a3>   DW_AT_decl_column : 15
    <3a4>   DW_AT_type        : <0xac>
    <3a8>   DW_AT_data_member_location: 164
 <2><3a9>: Abbrev Number: 1 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x507e5): D3AMR
    <3ae>   DW_AT_decl_file   : 4
    <3ae>   DW_AT_decl_line   : 1274
    <3b0>   DW_AT_decl_column : 16
    <3b1>   DW_AT_type        : <0xb8>
    <3b5>   DW_AT_data_member_location: 168
 <2><3b6>: Abbrev Number: 1 (DW_TAG_member)
    <3b7>   DW_AT_name        : (indirect string, offset: 0x147006): RESERVED11
    <3bb>   DW_AT_decl_file   : 4
    <3bb>   DW_AT_decl_line   : 1275
    <3bd>   DW_AT_decl_column : 15
    <3be>   DW_AT_type        : <0xe2>
    <3c2>   DW_AT_data_member_location: 172
 <2><3c3>: Abbrev Number: 7 (DW_TAG_member)
    <3c4>   DW_AT_name        : RSR
    <3c8>   DW_AT_decl_file   : 4
    <3c8>   DW_AT_decl_line   : 1276
    <3ca>   DW_AT_decl_column : 16
    <3cb>   DW_AT_type        : <0xb8>
    <3cf>   DW_AT_data_member_location: 208
 <2><3d0>: Abbrev Number: 1 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0xf0e97): AHB3ENR
    <3d5>   DW_AT_decl_file   : 4
    <3d5>   DW_AT_decl_line   : 1277
    <3d7>   DW_AT_decl_column : 16
    <3d8>   DW_AT_type        : <0xb8>
    <3dc>   DW_AT_data_member_location: 212
 <2><3dd>: Abbrev Number: 1 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0xb0c09): AHB1ENR
    <3e2>   DW_AT_decl_file   : 4
    <3e2>   DW_AT_decl_line   : 1278
    <3e4>   DW_AT_decl_column : 16
    <3e5>   DW_AT_type        : <0xb8>
    <3e9>   DW_AT_data_member_location: 216
 <2><3ea>: Abbrev Number: 1 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x222c8): AHB2ENR
    <3ef>   DW_AT_decl_file   : 4
    <3ef>   DW_AT_decl_line   : 1279
    <3f1>   DW_AT_decl_column : 16
    <3f2>   DW_AT_type        : <0xb8>
    <3f6>   DW_AT_data_member_location: 220
 <2><3f7>: Abbrev Number: 1 (DW_TAG_member)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x94e4a): AHB4ENR
    <3fc>   DW_AT_decl_file   : 4
    <3fc>   DW_AT_decl_line   : 1280
    <3fe>   DW_AT_decl_column : 16
    <3ff>   DW_AT_type        : <0xb8>
    <403>   DW_AT_data_member_location: 224
 <2><404>: Abbrev Number: 1 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0xd23ac): APB3ENR
    <409>   DW_AT_decl_file   : 4
    <409>   DW_AT_decl_line   : 1281
    <40b>   DW_AT_decl_column : 16
    <40c>   DW_AT_type        : <0xb8>
    <410>   DW_AT_data_member_location: 228
 <2><411>: Abbrev Number: 1 (DW_TAG_member)
    <412>   DW_AT_name        : (indirect string, offset: 0x1109a2): APB1LENR
    <416>   DW_AT_decl_file   : 4
    <416>   DW_AT_decl_line   : 1282
    <418>   DW_AT_decl_column : 16
    <419>   DW_AT_type        : <0xb8>
    <41d>   DW_AT_data_member_location: 232
 <2><41e>: Abbrev Number: 1 (DW_TAG_member)
    <41f>   DW_AT_name        : (indirect string, offset: 0x90d33): APB1HENR
    <423>   DW_AT_decl_file   : 4
    <423>   DW_AT_decl_line   : 1283
    <425>   DW_AT_decl_column : 16
    <426>   DW_AT_type        : <0xb8>
    <42a>   DW_AT_data_member_location: 236
 <2><42b>: Abbrev Number: 1 (DW_TAG_member)
    <42c>   DW_AT_name        : (indirect string, offset: 0x4e33): APB2ENR
    <430>   DW_AT_decl_file   : 4
    <430>   DW_AT_decl_line   : 1284
    <432>   DW_AT_decl_column : 16
    <433>   DW_AT_type        : <0xb8>
    <437>   DW_AT_data_member_location: 240
 <2><438>: Abbrev Number: 1 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0x441b7): APB4ENR
    <43d>   DW_AT_decl_file   : 4
    <43d>   DW_AT_decl_line   : 1285
    <43f>   DW_AT_decl_column : 16
    <440>   DW_AT_type        : <0xb8>
    <444>   DW_AT_data_member_location: 244
 <2><445>: Abbrev Number: 1 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0x147011): RESERVED12
    <44a>   DW_AT_decl_file   : 4
    <44a>   DW_AT_decl_line   : 1286
    <44c>   DW_AT_decl_column : 16
    <44d>   DW_AT_type        : <0xac>
    <451>   DW_AT_data_member_location: 248
 <2><452>: Abbrev Number: 1 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0x607ec): AHB3LPENR
    <457>   DW_AT_decl_file   : 4
    <457>   DW_AT_decl_line   : 1287
    <459>   DW_AT_decl_column : 16
    <45a>   DW_AT_type        : <0xb8>
    <45e>   DW_AT_data_member_location: 252
 <2><45f>: Abbrev Number: 4 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0x68688): AHB1LPENR
    <464>   DW_AT_decl_file   : 4
    <464>   DW_AT_decl_line   : 1288
    <466>   DW_AT_decl_column : 16
    <467>   DW_AT_type        : <0xb8>
    <46b>   DW_AT_data_member_location: 256
 <2><46d>: Abbrev Number: 4 (DW_TAG_member)
    <46e>   DW_AT_name        : (indirect string, offset: 0x6482f): AHB2LPENR
    <472>   DW_AT_decl_file   : 4
    <472>   DW_AT_decl_line   : 1289
    <474>   DW_AT_decl_column : 16
    <475>   DW_AT_type        : <0xb8>
    <479>   DW_AT_data_member_location: 260
 <2><47b>: Abbrev Number: 4 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x5d806): AHB4LPENR
    <480>   DW_AT_decl_file   : 4
    <480>   DW_AT_decl_line   : 1290
    <482>   DW_AT_decl_column : 16
    <483>   DW_AT_type        : <0xb8>
    <487>   DW_AT_data_member_location: 264
 <2><489>: Abbrev Number: 4 (DW_TAG_member)
    <48a>   DW_AT_name        : (indirect string, offset: 0x53513): APB3LPENR
    <48e>   DW_AT_decl_file   : 4
    <48e>   DW_AT_decl_line   : 1291
    <490>   DW_AT_decl_column : 16
    <491>   DW_AT_type        : <0xb8>
    <495>   DW_AT_data_member_location: 268
 <2><497>: Abbrev Number: 4 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x218ac): APB1LLPENR
    <49c>   DW_AT_decl_file   : 4
    <49c>   DW_AT_decl_line   : 1292
    <49e>   DW_AT_decl_column : 16
    <49f>   DW_AT_type        : <0xb8>
    <4a3>   DW_AT_data_member_location: 272
 <2><4a5>: Abbrev Number: 4 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x305b1): APB1HLPENR
    <4aa>   DW_AT_decl_file   : 4
    <4aa>   DW_AT_decl_line   : 1293
    <4ac>   DW_AT_decl_column : 16
    <4ad>   DW_AT_type        : <0xb8>
    <4b1>   DW_AT_data_member_location: 276
 <2><4b3>: Abbrev Number: 4 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x569fe): APB2LPENR
    <4b8>   DW_AT_decl_file   : 4
    <4b8>   DW_AT_decl_line   : 1294
    <4ba>   DW_AT_decl_column : 16
    <4bb>   DW_AT_type        : <0xb8>
    <4bf>   DW_AT_data_member_location: 280
 <2><4c1>: Abbrev Number: 4 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x4dc17): APB4LPENR
    <4c6>   DW_AT_decl_file   : 4
    <4c6>   DW_AT_decl_line   : 1295
    <4c8>   DW_AT_decl_column : 16
    <4c9>   DW_AT_type        : <0xb8>
    <4cd>   DW_AT_data_member_location: 284
 <2><4cf>: Abbrev Number: 4 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x14701c): RESERVED13
    <4d4>   DW_AT_decl_file   : 4
    <4d4>   DW_AT_decl_line   : 1296
    <4d6>   DW_AT_decl_column : 15
    <4d7>   DW_AT_type        : <0xbd>
    <4db>   DW_AT_data_member_location: 288
 <2><4dd>: Abbrev Number: 0
 <1><4de>: Abbrev Number: 13 (DW_TAG_typedef)
    <4df>   DW_AT_name        : (indirect string, offset: 0x14e56c): RCC_TypeDef
    <4e3>   DW_AT_decl_file   : 4
    <4e3>   DW_AT_decl_line   : 1298
    <4e5>   DW_AT_decl_column : 3
    <4e5>   DW_AT_type        : <0x17d>
 <1><4e9>: Abbrev Number: 2 (DW_TAG_base_type)
    <4ea>   DW_AT_byte_size   : 8
    <4eb>   DW_AT_encoding    : 4	(float)
    <4ec>   DW_AT_name        : (indirect string, offset: 0xc711e): long double
 <1><4f0>: Abbrev Number: 2 (DW_TAG_base_type)
    <4f1>   DW_AT_byte_size   : 1
    <4f2>   DW_AT_encoding    : 8	(unsigned char)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x12b18d): char
 <1><4f7>: Abbrev Number: 2 (DW_TAG_base_type)
    <4f8>   DW_AT_byte_size   : 4
    <4f9>   DW_AT_encoding    : 4	(float)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x73690): float
 <1><4fe>: Abbrev Number: 2 (DW_TAG_base_type)
    <4ff>   DW_AT_byte_size   : 8
    <500>   DW_AT_encoding    : 4	(float)
    <501>   DW_AT_name        : (indirect string, offset: 0x7e648): double
 <1><505>: Abbrev Number: 20 (DW_TAG_structure_type)
    <506>   DW_AT_byte_size   : 20
    <507>   DW_AT_decl_file   : 5
    <508>   DW_AT_decl_line   : 46
    <509>   DW_AT_decl_column : 9
    <50a>   DW_AT_sibling     : <0x548>
 <2><50e>: Abbrev Number: 21 (DW_TAG_member)
    <50f>   DW_AT_name        : Pin
    <513>   DW_AT_decl_file   : 5
    <514>   DW_AT_decl_line   : 48
    <515>   DW_AT_decl_column : 12
    <516>   DW_AT_type        : <0xac>
    <51a>   DW_AT_data_member_location: 0
 <2><51b>: Abbrev Number: 9 (DW_TAG_member)
    <51c>   DW_AT_name        : (indirect string, offset: 0x15fbe2): Mode
    <520>   DW_AT_decl_file   : 5
    <520>   DW_AT_decl_line   : 51
    <521>   DW_AT_decl_column : 12
    <521>   DW_AT_type        : <0xac>
    <525>   DW_AT_data_member_location: 4
 <2><526>: Abbrev Number: 9 (DW_TAG_member)
    <527>   DW_AT_name        : (indirect string, offset: 0x161495): Pull
    <52b>   DW_AT_decl_file   : 5
    <52b>   DW_AT_decl_line   : 54
    <52c>   DW_AT_decl_column : 12
    <52c>   DW_AT_type        : <0xac>
    <530>   DW_AT_data_member_location: 8
 <2><531>: Abbrev Number: 9 (DW_TAG_member)
    <532>   DW_AT_name        : (indirect string, offset: 0x574a): Speed
    <536>   DW_AT_decl_file   : 5
    <536>   DW_AT_decl_line   : 57
    <537>   DW_AT_decl_column : 12
    <537>   DW_AT_type        : <0xac>
    <53b>   DW_AT_data_member_location: 12
 <2><53c>: Abbrev Number: 9 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x14cc28): Alternate
    <541>   DW_AT_decl_file   : 5
    <541>   DW_AT_decl_line   : 60
    <542>   DW_AT_decl_column : 12
    <542>   DW_AT_type        : <0xac>
    <546>   DW_AT_data_member_location: 16
 <2><547>: Abbrev Number: 0
 <1><548>: Abbrev Number: 5 (DW_TAG_typedef)
    <549>   DW_AT_name        : (indirect string, offset: 0x715a1): GPIO_InitTypeDef
    <54d>   DW_AT_decl_file   : 5
    <54e>   DW_AT_decl_line   : 62
    <54f>   DW_AT_decl_column : 3
    <550>   DW_AT_type        : <0x505>
 <1><554>: Abbrev Number: 22 (DW_TAG_const_type)
    <555>   DW_AT_type        : <0x548>
 <1><559>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <55a>   DW_AT_encoding    : 7	(unsigned)
    <55b>   DW_AT_byte_size   : 1
    <55c>   DW_AT_type        : <0x44>
    <560>   DW_AT_decl_file   : 5
    <561>   DW_AT_decl_line   : 68
    <562>   DW_AT_decl_column : 1
    <563>   DW_AT_sibling     : <0x574>
 <2><567>: Abbrev Number: 14 (DW_TAG_enumerator)
    <568>   DW_AT_name        : (indirect string, offset: 0x4548f): GPIO_PIN_RESET
    <56c>   DW_AT_const_value : 0
 <2><56d>: Abbrev Number: 14 (DW_TAG_enumerator)
    <56e>   DW_AT_name        : (indirect string, offset: 0x9b69c): GPIO_PIN_SET
    <572>   DW_AT_const_value : 1
 <2><573>: Abbrev Number: 0
 <1><574>: Abbrev Number: 5 (DW_TAG_typedef)
    <575>   DW_AT_name        : (indirect string, offset: 0x1565af): GPIO_PinState
    <579>   DW_AT_decl_file   : 5
    <57a>   DW_AT_decl_line   : 71
    <57b>   DW_AT_decl_column : 3
    <57c>   DW_AT_type        : <0x559>
 <1><580>: Abbrev Number: 24 (DW_TAG_subprogram)
    <581>   DW_AT_external    : 1
    <581>   DW_AT_name        : (indirect string, offset: 0x3d710): HAL_GPIO_Init
    <585>   DW_AT_decl_file   : 5
    <586>   DW_AT_decl_line   : 255
    <587>   DW_AT_decl_column : 7
    <588>   DW_AT_prototyped  : 1
    <588>   DW_AT_declaration : 1
    <588>   DW_AT_sibling     : <0x597>
 <2><58c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <58d>   DW_AT_type        : <0x597>
 <2><591>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <592>   DW_AT_type        : <0x59c>
 <2><596>: Abbrev Number: 0
 <1><597>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <598>   DW_AT_byte_size   : 4
    <598>   DW_AT_type        : <0x172>
 <1><59c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <59d>   DW_AT_byte_size   : 4
    <59d>   DW_AT_type        : <0x554>
 <1><5a1>: Abbrev Number: 25 (DW_TAG_subprogram)
    <5a2>   DW_AT_external    : 1
    <5a2>   DW_AT_name        : (indirect string, offset: 0x9c3d3): HAL_GPIO_WritePin
    <5a6>   DW_AT_decl_file   : 5
    <5a7>   DW_AT_decl_line   : 266
    <5a9>   DW_AT_decl_column : 6
    <5aa>   DW_AT_prototyped  : 1
    <5aa>   DW_AT_declaration : 1
    <5aa>   DW_AT_sibling     : <0x5be>
 <2><5ae>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <5af>   DW_AT_type        : <0x597>
 <2><5b3>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <5b4>   DW_AT_type        : <0xa0>
 <2><5b8>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <5b9>   DW_AT_type        : <0x574>
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 26 (DW_TAG_subprogram)
    <5bf>   DW_AT_external    : 1
    <5bf>   DW_AT_name        : (indirect string, offset: 0x38cb2): MX_GPIO_Init
    <5c3>   DW_AT_decl_file   : 1
    <5c4>   DW_AT_decl_line   : 44
    <5c5>   DW_AT_decl_column : 6
    <5c6>   DW_AT_prototyped  : 1
    <5c6>   DW_AT_low_pc      : 0x8000380
    <5ca>   DW_AT_high_pc     : 0x290
    <5ce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5d0>   DW_AT_call_all_tail_calls: 1
 <2><5d0>: Abbrev Number: 3 (DW_TAG_variable)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x1145e): GPIO_InitStruct
    <5d5>   DW_AT_decl_file   : 1
    <5d5>   DW_AT_decl_line   : 47
    <5d6>   DW_AT_decl_column : 20
    <5d7>   DW_AT_type        : <0x548>
    <5db>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><5de>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <5df>   DW_AT_low_pc      : 0x8000396
    <5e3>   DW_AT_high_pc     : 0x1e
    <5e7>   DW_AT_sibling     : <0x5fa>
 <3><5eb>: Abbrev Number: 3 (DW_TAG_variable)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <5f0>   DW_AT_decl_file   : 1
    <5f0>   DW_AT_decl_line   : 50
    <5f1>   DW_AT_decl_column : 3
    <5f2>   DW_AT_type        : <0xb8>
    <5f6>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><5f9>: Abbrev Number: 0
 <2><5fa>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <5fb>   DW_AT_low_pc      : 0x80003b4
    <5ff>   DW_AT_high_pc     : 0x1e
    <603>   DW_AT_sibling     : <0x616>
 <3><607>: Abbrev Number: 3 (DW_TAG_variable)
    <608>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <60c>   DW_AT_decl_file   : 1
    <60c>   DW_AT_decl_line   : 51
    <60d>   DW_AT_decl_column : 3
    <60e>   DW_AT_type        : <0xb8>
    <612>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><615>: Abbrev Number: 0
 <2><616>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <617>   DW_AT_low_pc      : 0x80003d2
    <61b>   DW_AT_high_pc     : 0x1e
    <61f>   DW_AT_sibling     : <0x632>
 <3><623>: Abbrev Number: 3 (DW_TAG_variable)
    <624>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <628>   DW_AT_decl_file   : 1
    <628>   DW_AT_decl_line   : 52
    <629>   DW_AT_decl_column : 3
    <62a>   DW_AT_type        : <0xb8>
    <62e>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><631>: Abbrev Number: 0
 <2><632>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <633>   DW_AT_low_pc      : 0x80003f0
    <637>   DW_AT_high_pc     : 0x1e
    <63b>   DW_AT_sibling     : <0x64e>
 <3><63f>: Abbrev Number: 3 (DW_TAG_variable)
    <640>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <644>   DW_AT_decl_file   : 1
    <644>   DW_AT_decl_line   : 53
    <645>   DW_AT_decl_column : 3
    <646>   DW_AT_type        : <0xb8>
    <64a>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><64d>: Abbrev Number: 0
 <2><64e>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <64f>   DW_AT_low_pc      : 0x800040e
    <653>   DW_AT_high_pc     : 0x1e
    <657>   DW_AT_sibling     : <0x66a>
 <3><65b>: Abbrev Number: 3 (DW_TAG_variable)
    <65c>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <660>   DW_AT_decl_file   : 1
    <660>   DW_AT_decl_line   : 54
    <661>   DW_AT_decl_column : 3
    <662>   DW_AT_type        : <0xb8>
    <666>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><669>: Abbrev Number: 0
 <2><66a>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <66b>   DW_AT_low_pc      : 0x800042c
    <66f>   DW_AT_high_pc     : 0x1e
    <673>   DW_AT_sibling     : <0x686>
 <3><677>: Abbrev Number: 3 (DW_TAG_variable)
    <678>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <67c>   DW_AT_decl_file   : 1
    <67c>   DW_AT_decl_line   : 55
    <67d>   DW_AT_decl_column : 3
    <67e>   DW_AT_type        : <0xb8>
    <682>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><685>: Abbrev Number: 0
 <2><686>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <687>   DW_AT_low_pc      : 0x800044a
    <68b>   DW_AT_high_pc     : 0x1e
    <68f>   DW_AT_sibling     : <0x6a2>
 <3><693>: Abbrev Number: 3 (DW_TAG_variable)
    <694>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <698>   DW_AT_decl_file   : 1
    <698>   DW_AT_decl_line   : 56
    <699>   DW_AT_decl_column : 3
    <69a>   DW_AT_type        : <0xb8>
    <69e>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <3><6a1>: Abbrev Number: 0
 <2><6a2>: Abbrev Number: 6 (DW_TAG_lexical_block)
    <6a3>   DW_AT_low_pc      : 0x8000468
    <6a7>   DW_AT_high_pc     : 0x1e
    <6ab>   DW_AT_sibling     : <0x6be>
 <3><6af>: Abbrev Number: 3 (DW_TAG_variable)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <6b4>   DW_AT_decl_file   : 1
    <6b4>   DW_AT_decl_line   : 57
    <6b5>   DW_AT_decl_column : 3
    <6b6>   DW_AT_type        : <0xb8>
    <6ba>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <3><6bd>: Abbrev Number: 0
 <2><6be>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <6bf>   DW_AT_low_pc      : 0x8000486
    <6c3>   DW_AT_high_pc     : 0x1e
 <3><6c7>: Abbrev Number: 3 (DW_TAG_variable)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x4f617): tmpreg
    <6cc>   DW_AT_decl_file   : 1
    <6cc>   DW_AT_decl_line   : 58
    <6cd>   DW_AT_decl_column : 3
    <6ce>   DW_AT_type        : <0xb8>
    <6d2>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <3><6d5>: Abbrev Number: 0
 <2><6d6>: Abbrev Number: 0
 <1><6d7>: Abbrev Number: 0
  Compilation Unit @ offset 0x6d8:
   Length:        0x1067 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x189
   Pointer Size:  4
 <0><6e4>: Abbrev Number: 40 (DW_TAG_compile_unit)
    <6e5>   DW_AT_producer    : (indirect string, offset: 0x9f6e1): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp.dp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <6e9>   DW_AT_language    : 29	(C11)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x15b4c0): ../Core/Src/main.c
    <6ee>   DW_AT_comp_dir    : (indirect string, offset: 0xf5ec7): /home/ducnt/workspace/h753duc/Debug
    <6f2>   DW_AT_ranges      : 0x3c
    <6f6>   DW_AT_low_pc      : 0
    <6fa>   DW_AT_stmt_list   : 0x891
    <6fe>   DW_AT_macros      : 0x33f08
 <1><702>: Abbrev Number: 7 (DW_TAG_base_type)
    <703>   DW_AT_byte_size   : 2
    <704>   DW_AT_encoding    : 5	(signed)
    <705>   DW_AT_name        : (indirect string, offset: 0x8f449): short int
 <1><709>: Abbrev Number: 7 (DW_TAG_base_type)
    <70a>   DW_AT_byte_size   : 1
    <70b>   DW_AT_encoding    : 6	(signed char)
    <70c>   DW_AT_name        : (indirect string, offset: 0x12b186): signed char
 <1><710>: Abbrev Number: 9 (DW_TAG_typedef)
    <711>   DW_AT_name        : (indirect string, offset: 0xbab0d): __uint8_t
    <715>   DW_AT_decl_file   : 4
    <716>   DW_AT_decl_line   : 43
    <717>   DW_AT_decl_column : 24
    <718>   DW_AT_type        : <0x71c>
 <1><71c>: Abbrev Number: 7 (DW_TAG_base_type)
    <71d>   DW_AT_byte_size   : 1
    <71e>   DW_AT_encoding    : 8	(unsigned char)
    <71f>   DW_AT_name        : (indirect string, offset: 0xaded0): unsigned char
 <1><723>: Abbrev Number: 9 (DW_TAG_typedef)
    <724>   DW_AT_name        : (indirect string, offset: 0x5719): __uint16_t
    <728>   DW_AT_decl_file   : 4
    <729>   DW_AT_decl_line   : 57
    <72a>   DW_AT_decl_column : 25
    <72b>   DW_AT_type        : <0x72f>
 <1><72f>: Abbrev Number: 7 (DW_TAG_base_type)
    <730>   DW_AT_byte_size   : 2
    <731>   DW_AT_encoding    : 7	(unsigned)
    <732>   DW_AT_name        : (indirect string, offset: 0x6113f): short unsigned int
 <1><736>: Abbrev Number: 7 (DW_TAG_base_type)
    <737>   DW_AT_byte_size   : 4
    <738>   DW_AT_encoding    : 5	(signed)
    <739>   DW_AT_name        : (indirect string, offset: 0x12a380): long int
 <1><73d>: Abbrev Number: 9 (DW_TAG_typedef)
    <73e>   DW_AT_name        : (indirect string, offset: 0x1404d0): __uint32_t
    <742>   DW_AT_decl_file   : 4
    <743>   DW_AT_decl_line   : 79
    <744>   DW_AT_decl_column : 25
    <745>   DW_AT_type        : <0x749>
 <1><749>: Abbrev Number: 7 (DW_TAG_base_type)
    <74a>   DW_AT_byte_size   : 4
    <74b>   DW_AT_encoding    : 7	(unsigned)
    <74c>   DW_AT_name        : (indirect string, offset: 0x9fda8): long unsigned int
 <1><750>: Abbrev Number: 7 (DW_TAG_base_type)
    <751>   DW_AT_byte_size   : 8
    <752>   DW_AT_encoding    : 5	(signed)
    <753>   DW_AT_name        : (indirect string, offset: 0x9a4e): long long int
 <1><757>: Abbrev Number: 7 (DW_TAG_base_type)
    <758>   DW_AT_byte_size   : 8
    <759>   DW_AT_encoding    : 7	(unsigned)
    <75a>   DW_AT_name        : (indirect string, offset: 0xb0db2): long long unsigned int
 <1><75e>: Abbrev Number: 41 (DW_TAG_base_type)
    <75f>   DW_AT_byte_size   : 4
    <760>   DW_AT_encoding    : 5	(signed)
    <761>   DW_AT_name        : int
 <1><765>: Abbrev Number: 7 (DW_TAG_base_type)
    <766>   DW_AT_byte_size   : 4
    <767>   DW_AT_encoding    : 7	(unsigned)
    <768>   DW_AT_name        : (indirect string, offset: 0x9f6d4): unsigned int
 <1><76c>: Abbrev Number: 9 (DW_TAG_typedef)
    <76d>   DW_AT_name        : (indirect string, offset: 0xbab0f): uint8_t
    <771>   DW_AT_decl_file   : 5
    <772>   DW_AT_decl_line   : 24
    <773>   DW_AT_decl_column : 19
    <774>   DW_AT_type        : <0x710>
 <1><778>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <779>   DW_AT_type        : <0x76c>
 <1><77d>: Abbrev Number: 9 (DW_TAG_typedef)
    <77e>   DW_AT_name        : (indirect string, offset: 0x571b): uint16_t
    <782>   DW_AT_decl_file   : 5
    <783>   DW_AT_decl_line   : 36
    <784>   DW_AT_decl_column : 20
    <785>   DW_AT_type        : <0x723>
 <1><789>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <78a>   DW_AT_type        : <0x77d>
 <1><78e>: Abbrev Number: 9 (DW_TAG_typedef)
    <78f>   DW_AT_name        : (indirect string, offset: 0x1404d2): uint32_t
    <793>   DW_AT_decl_file   : 5
    <794>   DW_AT_decl_line   : 48
    <795>   DW_AT_decl_column : 20
    <796>   DW_AT_type        : <0x73d>
 <1><79a>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <79b>   DW_AT_type        : <0x78e>
 <1><79f>: Abbrev Number: 13 (DW_TAG_const_type)
    <7a0>   DW_AT_type        : <0x79a>
 <1><7a4>: Abbrev Number: 23 (DW_TAG_structure_type)
    <7a5>   DW_AT_byte_size   : 684
    <7a7>   DW_AT_decl_file   : 2
    <7a8>   DW_AT_decl_line   : 455
    <7aa>   DW_AT_decl_column : 9
    <7aa>   DW_AT_sibling     : <0xa83>
 <2><7ae>: Abbrev Number: 2 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0x160a34): CPUID
    <7b3>   DW_AT_decl_file   : 2
    <7b4>   DW_AT_decl_line   : 457
    <7b6>   DW_AT_decl_column : 18
    <7b7>   DW_AT_type        : <0x79f>
    <7bb>   DW_AT_data_member_location: 0
 <2><7bc>: Abbrev Number: 2 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x15b2ea): ICSR
    <7c1>   DW_AT_decl_file   : 2
    <7c2>   DW_AT_decl_line   : 458
    <7c4>   DW_AT_decl_column : 18
    <7c5>   DW_AT_type        : <0x79a>
    <7c9>   DW_AT_data_member_location: 4
 <2><7ca>: Abbrev Number: 2 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x15b02e): VTOR
    <7cf>   DW_AT_decl_file   : 2
    <7d0>   DW_AT_decl_line   : 459
    <7d2>   DW_AT_decl_column : 18
    <7d3>   DW_AT_type        : <0x79a>
    <7d7>   DW_AT_data_member_location: 8
 <2><7d8>: Abbrev Number: 2 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0x15ba51): AIRCR
    <7dd>   DW_AT_decl_file   : 2
    <7de>   DW_AT_decl_line   : 460
    <7e0>   DW_AT_decl_column : 18
    <7e1>   DW_AT_type        : <0x79a>
    <7e5>   DW_AT_data_member_location: 12
 <2><7e6>: Abbrev Number: 14 (DW_TAG_member)
    <7e7>   DW_AT_name        : SCR
    <7eb>   DW_AT_decl_file   : 2
    <7ec>   DW_AT_decl_line   : 461
    <7ee>   DW_AT_decl_column : 18
    <7ef>   DW_AT_type        : <0x79a>
    <7f3>   DW_AT_data_member_location: 16
 <2><7f4>: Abbrev Number: 14 (DW_TAG_member)
    <7f5>   DW_AT_name        : CCR
    <7f9>   DW_AT_decl_file   : 2
    <7fa>   DW_AT_decl_line   : 462
    <7fc>   DW_AT_decl_column : 18
    <7fd>   DW_AT_type        : <0x79a>
    <801>   DW_AT_data_member_location: 20
 <2><802>: Abbrev Number: 2 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x15b598): SHPR
    <807>   DW_AT_decl_file   : 2
    <808>   DW_AT_decl_line   : 463
    <80a>   DW_AT_decl_column : 18
    <80b>   DW_AT_type        : <0xa93>
    <80f>   DW_AT_data_member_location: 24
 <2><810>: Abbrev Number: 2 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0x15b03d): SHCSR
    <815>   DW_AT_decl_file   : 2
    <816>   DW_AT_decl_line   : 464
    <818>   DW_AT_decl_column : 18
    <819>   DW_AT_type        : <0x79a>
    <81d>   DW_AT_data_member_location: 36
 <2><81e>: Abbrev Number: 2 (DW_TAG_member)
    <81f>   DW_AT_name        : (indirect string, offset: 0x15b945): CFSR
    <823>   DW_AT_decl_file   : 2
    <824>   DW_AT_decl_line   : 465
    <826>   DW_AT_decl_column : 18
    <827>   DW_AT_type        : <0x79a>
    <82b>   DW_AT_data_member_location: 40
 <2><82c>: Abbrev Number: 2 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x15b871): HFSR
    <831>   DW_AT_decl_file   : 2
    <832>   DW_AT_decl_line   : 466
    <834>   DW_AT_decl_column : 18
    <835>   DW_AT_type        : <0x79a>
    <839>   DW_AT_data_member_location: 44
 <2><83a>: Abbrev Number: 2 (DW_TAG_member)
    <83b>   DW_AT_name        : (indirect string, offset: 0x15b985): DFSR
    <83f>   DW_AT_decl_file   : 2
    <840>   DW_AT_decl_line   : 467
    <842>   DW_AT_decl_column : 18
    <843>   DW_AT_type        : <0x79a>
    <847>   DW_AT_data_member_location: 48
 <2><848>: Abbrev Number: 2 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0x15b94f): MMFAR
    <84d>   DW_AT_decl_file   : 2
    <84e>   DW_AT_decl_line   : 468
    <850>   DW_AT_decl_column : 18
    <851>   DW_AT_type        : <0x79a>
    <855>   DW_AT_data_member_location: 52
 <2><856>: Abbrev Number: 2 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x15b390): BFAR
    <85b>   DW_AT_decl_file   : 2
    <85c>   DW_AT_decl_line   : 469
    <85e>   DW_AT_decl_column : 18
    <85f>   DW_AT_type        : <0x79a>
    <863>   DW_AT_data_member_location: 56
 <2><864>: Abbrev Number: 2 (DW_TAG_member)
    <865>   DW_AT_name        : (indirect string, offset: 0x15b750): AFSR
    <869>   DW_AT_decl_file   : 2
    <86a>   DW_AT_decl_line   : 470
    <86c>   DW_AT_decl_column : 18
    <86d>   DW_AT_type        : <0x79a>
    <871>   DW_AT_data_member_location: 60
 <2><872>: Abbrev Number: 2 (DW_TAG_member)
    <873>   DW_AT_name        : (indirect string, offset: 0x15b71e): ID_PFR
    <877>   DW_AT_decl_file   : 2
    <878>   DW_AT_decl_line   : 471
    <87a>   DW_AT_decl_column : 18
    <87b>   DW_AT_type        : <0xaad>
    <87f>   DW_AT_data_member_location: 64
 <2><880>: Abbrev Number: 2 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x15b0b0): ID_DFR
    <885>   DW_AT_decl_file   : 2
    <886>   DW_AT_decl_line   : 472
    <888>   DW_AT_decl_column : 18
    <889>   DW_AT_type        : <0x79f>
    <88d>   DW_AT_data_member_location: 72
 <2><88e>: Abbrev Number: 2 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0x15b717): ID_AFR
    <893>   DW_AT_decl_file   : 2
    <894>   DW_AT_decl_line   : 473
    <896>   DW_AT_decl_column : 18
    <897>   DW_AT_type        : <0x79f>
    <89b>   DW_AT_data_member_location: 76
 <2><89c>: Abbrev Number: 2 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x15b818): ID_MFR
    <8a1>   DW_AT_decl_file   : 2
    <8a2>   DW_AT_decl_line   : 474
    <8a4>   DW_AT_decl_column : 18
    <8a5>   DW_AT_type        : <0xac7>
    <8a9>   DW_AT_data_member_location: 80
 <2><8aa>: Abbrev Number: 2 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x15affa): ID_ISAR
    <8af>   DW_AT_decl_file   : 2
    <8b0>   DW_AT_decl_line   : 475
    <8b2>   DW_AT_decl_column : 18
    <8b3>   DW_AT_type        : <0xae1>
    <8b7>   DW_AT_data_member_location: 96
 <2><8b8>: Abbrev Number: 2 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x15b42a): RESERVED0
    <8bd>   DW_AT_decl_file   : 2
    <8be>   DW_AT_decl_line   : 476
    <8c0>   DW_AT_decl_column : 18
    <8c1>   DW_AT_type        : <0xae6>
    <8c5>   DW_AT_data_member_location: 116
 <2><8c6>: Abbrev Number: 2 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x15ba44): CLIDR
    <8cb>   DW_AT_decl_file   : 2
    <8cc>   DW_AT_decl_line   : 477
    <8ce>   DW_AT_decl_column : 18
    <8cf>   DW_AT_type        : <0x79f>
    <8d3>   DW_AT_data_member_location: 120
 <2><8d4>: Abbrev Number: 14 (DW_TAG_member)
    <8d5>   DW_AT_name        : CTR
    <8d9>   DW_AT_decl_file   : 2
    <8da>   DW_AT_decl_line   : 478
    <8dc>   DW_AT_decl_column : 18
    <8dd>   DW_AT_type        : <0x79f>
    <8e1>   DW_AT_data_member_location: 124
 <2><8e2>: Abbrev Number: 2 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x15b6eb): CCSIDR
    <8e7>   DW_AT_decl_file   : 2
    <8e8>   DW_AT_decl_line   : 479
    <8ea>   DW_AT_decl_column : 18
    <8eb>   DW_AT_type        : <0x79f>
    <8ef>   DW_AT_data_member_location: 128
 <2><8f0>: Abbrev Number: 2 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x15b1d2): CSSELR
    <8f5>   DW_AT_decl_file   : 2
    <8f6>   DW_AT_decl_line   : 480
    <8f8>   DW_AT_decl_column : 18
    <8f9>   DW_AT_type        : <0x79a>
    <8fd>   DW_AT_data_member_location: 132
 <2><8fe>: Abbrev Number: 2 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x15b1b6): CPACR
    <903>   DW_AT_decl_file   : 2
    <904>   DW_AT_decl_line   : 481
    <906>   DW_AT_decl_column : 18
    <907>   DW_AT_type        : <0x79a>
    <90b>   DW_AT_data_member_location: 136
 <2><90c>: Abbrev Number: 2 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0x107658): RESERVED3
    <911>   DW_AT_decl_file   : 2
    <912>   DW_AT_decl_line   : 482
    <914>   DW_AT_decl_column : 18
    <915>   DW_AT_type        : <0xaf6>
    <919>   DW_AT_data_member_location: 140
 <2><91a>: Abbrev Number: 1 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x15b638): STIR
    <91f>   DW_AT_decl_file   : 2
    <920>   DW_AT_decl_line   : 483
    <922>   DW_AT_decl_column : 18
    <923>   DW_AT_type        : <0x79a>
    <927>   DW_AT_data_member_location: 512
 <2><929>: Abbrev Number: 1 (DW_TAG_member)
    <92a>   DW_AT_name        : (indirect string, offset: 0x67b48): RESERVED4
    <92e>   DW_AT_decl_file   : 2
    <92f>   DW_AT_decl_line   : 484
    <931>   DW_AT_decl_column : 18
    <932>   DW_AT_type        : <0xb06>
    <936>   DW_AT_data_member_location: 516
 <2><938>: Abbrev Number: 1 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x15b301): MVFR0
    <93d>   DW_AT_decl_file   : 2
    <93e>   DW_AT_decl_line   : 485
    <940>   DW_AT_decl_column : 18
    <941>   DW_AT_type        : <0x79f>
    <945>   DW_AT_data_member_location: 576
 <2><947>: Abbrev Number: 1 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0x15b0c4): MVFR1
    <94c>   DW_AT_decl_file   : 2
    <94d>   DW_AT_decl_line   : 486
    <94f>   DW_AT_decl_column : 18
    <950>   DW_AT_type        : <0x79f>
    <954>   DW_AT_data_member_location: 580
 <2><956>: Abbrev Number: 1 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x15b307): MVFR2
    <95b>   DW_AT_decl_file   : 2
    <95c>   DW_AT_decl_line   : 487
    <95e>   DW_AT_decl_column : 18
    <95f>   DW_AT_type        : <0x79f>
    <963>   DW_AT_data_member_location: 584
 <2><965>: Abbrev Number: 1 (DW_TAG_member)
    <966>   DW_AT_name        : (indirect string, offset: 0x67b52): RESERVED5
    <96a>   DW_AT_decl_file   : 2
    <96b>   DW_AT_decl_line   : 488
    <96d>   DW_AT_decl_column : 18
    <96e>   DW_AT_type        : <0xae6>
    <972>   DW_AT_data_member_location: 588
 <2><974>: Abbrev Number: 1 (DW_TAG_member)
    <975>   DW_AT_name        : (indirect string, offset: 0x15b770): ICIALLU
    <979>   DW_AT_decl_file   : 2
    <97a>   DW_AT_decl_line   : 489
    <97c>   DW_AT_decl_column : 18
    <97d>   DW_AT_type        : <0x79a>
    <981>   DW_AT_data_member_location: 592
 <2><983>: Abbrev Number: 1 (DW_TAG_member)
    <984>   DW_AT_name        : (indirect string, offset: 0x67b5c): RESERVED6
    <988>   DW_AT_decl_file   : 2
    <989>   DW_AT_decl_line   : 490
    <98b>   DW_AT_decl_column : 18
    <98c>   DW_AT_type        : <0xae6>
    <990>   DW_AT_data_member_location: 596
 <2><992>: Abbrev Number: 1 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0x15b782): ICIMVAU
    <997>   DW_AT_decl_file   : 2
    <998>   DW_AT_decl_line   : 491
    <99a>   DW_AT_decl_column : 18
    <99b>   DW_AT_type        : <0x79a>
    <99f>   DW_AT_data_member_location: 600
 <2><9a1>: Abbrev Number: 1 (DW_TAG_member)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x15ba76): DCIMVAC
    <9a6>   DW_AT_decl_file   : 2
    <9a7>   DW_AT_decl_line   : 492
    <9a9>   DW_AT_decl_column : 18
    <9aa>   DW_AT_type        : <0x79a>
    <9ae>   DW_AT_data_member_location: 604
 <2><9b0>: Abbrev Number: 1 (DW_TAG_member)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x15b32f): DCISW
    <9b5>   DW_AT_decl_file   : 2
    <9b6>   DW_AT_decl_line   : 493
    <9b8>   DW_AT_decl_column : 18
    <9b9>   DW_AT_type        : <0x79a>
    <9bd>   DW_AT_data_member_location: 608
 <2><9bf>: Abbrev Number: 1 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x15b369): DCCMVAU
    <9c4>   DW_AT_decl_file   : 2
    <9c5>   DW_AT_decl_line   : 494
    <9c7>   DW_AT_decl_column : 18
    <9c8>   DW_AT_type        : <0x79a>
    <9cc>   DW_AT_data_member_location: 612
 <2><9ce>: Abbrev Number: 1 (DW_TAG_member)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x15b748): DCCMVAC
    <9d3>   DW_AT_decl_file   : 2
    <9d4>   DW_AT_decl_line   : 495
    <9d6>   DW_AT_decl_column : 18
    <9d7>   DW_AT_type        : <0x79a>
    <9db>   DW_AT_data_member_location: 616
 <2><9dd>: Abbrev Number: 1 (DW_TAG_member)
    <9de>   DW_AT_name        : (indirect string, offset: 0x15b86b): DCCSW
    <9e2>   DW_AT_decl_file   : 2
    <9e3>   DW_AT_decl_line   : 496
    <9e5>   DW_AT_decl_column : 18
    <9e6>   DW_AT_type        : <0x79a>
    <9ea>   DW_AT_data_member_location: 620
 <2><9ec>: Abbrev Number: 1 (DW_TAG_member)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x15b212): DCCIMVAC
    <9f1>   DW_AT_decl_file   : 2
    <9f2>   DW_AT_decl_line   : 497
    <9f4>   DW_AT_decl_column : 18
    <9f5>   DW_AT_type        : <0x79a>
    <9f9>   DW_AT_data_member_location: 624
 <2><9fb>: Abbrev Number: 1 (DW_TAG_member)
    <9fc>   DW_AT_name        : (indirect string, offset: 0x15b1c5): DCCISW
    <a00>   DW_AT_decl_file   : 2
    <a01>   DW_AT_decl_line   : 498
    <a03>   DW_AT_decl_column : 18
    <a04>   DW_AT_type        : <0x79a>
    <a08>   DW_AT_data_member_location: 628
 <2><a0a>: Abbrev Number: 1 (DW_TAG_member)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x15b434): RESERVED7
    <a0f>   DW_AT_decl_file   : 2
    <a10>   DW_AT_decl_line   : 499
    <a12>   DW_AT_decl_column : 18
    <a13>   DW_AT_type        : <0xb16>
    <a17>   DW_AT_data_member_location: 632
 <2><a19>: Abbrev Number: 1 (DW_TAG_member)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x15b7d0): ITCMCR
    <a1e>   DW_AT_decl_file   : 2
    <a1f>   DW_AT_decl_line   : 500
    <a21>   DW_AT_decl_column : 18
    <a22>   DW_AT_type        : <0x79a>
    <a26>   DW_AT_data_member_location: 656
 <2><a28>: Abbrev Number: 1 (DW_TAG_member)
    <a29>   DW_AT_name        : (indirect string, offset: 0x15b81f): DTCMCR
    <a2d>   DW_AT_decl_file   : 2
    <a2e>   DW_AT_decl_line   : 501
    <a30>   DW_AT_decl_column : 18
    <a31>   DW_AT_type        : <0x79a>
    <a35>   DW_AT_data_member_location: 660
 <2><a37>: Abbrev Number: 1 (DW_TAG_member)
    <a38>   DW_AT_name        : (indirect string, offset: 0x15b84d): AHBPCR
    <a3c>   DW_AT_decl_file   : 2
    <a3d>   DW_AT_decl_line   : 502
    <a3f>   DW_AT_decl_column : 18
    <a40>   DW_AT_type        : <0x79a>
    <a44>   DW_AT_data_member_location: 664
 <2><a46>: Abbrev Number: 1 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0x15b610): CACR
    <a4b>   DW_AT_decl_file   : 2
    <a4c>   DW_AT_decl_line   : 503
    <a4e>   DW_AT_decl_column : 18
    <a4f>   DW_AT_type        : <0x79a>
    <a53>   DW_AT_data_member_location: 668
 <2><a55>: Abbrev Number: 1 (DW_TAG_member)
    <a56>   DW_AT_name        : (indirect string, offset: 0x15afe7): AHBSCR
    <a5a>   DW_AT_decl_file   : 2
    <a5b>   DW_AT_decl_line   : 504
    <a5d>   DW_AT_decl_column : 18
    <a5e>   DW_AT_type        : <0x79a>
    <a62>   DW_AT_data_member_location: 672
 <2><a64>: Abbrev Number: 1 (DW_TAG_member)
    <a65>   DW_AT_name        : (indirect string, offset: 0x67b66): RESERVED8
    <a69>   DW_AT_decl_file   : 2
    <a6a>   DW_AT_decl_line   : 505
    <a6c>   DW_AT_decl_column : 18
    <a6d>   DW_AT_type        : <0xae6>
    <a71>   DW_AT_data_member_location: 676
 <2><a73>: Abbrev Number: 1 (DW_TAG_member)
    <a74>   DW_AT_name        : (indirect string, offset: 0x15b812): ABFSR
    <a78>   DW_AT_decl_file   : 2
    <a79>   DW_AT_decl_line   : 506
    <a7b>   DW_AT_decl_column : 18
    <a7c>   DW_AT_type        : <0x79a>
    <a80>   DW_AT_data_member_location: 680
 <2><a82>: Abbrev Number: 0
 <1><a83>: Abbrev Number: 5 (DW_TAG_array_type)
    <a84>   DW_AT_type        : <0x778>
    <a88>   DW_AT_sibling     : <0xa93>
 <2><a8c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <a8d>   DW_AT_type        : <0x765>
    <a91>   DW_AT_upper_bound : 11
 <2><a92>: Abbrev Number: 0
 <1><a93>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <a94>   DW_AT_type        : <0xa83>
 <1><a98>: Abbrev Number: 5 (DW_TAG_array_type)
    <a99>   DW_AT_type        : <0x79f>
    <a9d>   DW_AT_sibling     : <0xaa8>
 <2><aa1>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <aa2>   DW_AT_type        : <0x765>
    <aa6>   DW_AT_upper_bound : 1
 <2><aa7>: Abbrev Number: 0
 <1><aa8>: Abbrev Number: 13 (DW_TAG_const_type)
    <aa9>   DW_AT_type        : <0xa98>
 <1><aad>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <aae>   DW_AT_type        : <0xaa8>
 <1><ab2>: Abbrev Number: 5 (DW_TAG_array_type)
    <ab3>   DW_AT_type        : <0x79f>
    <ab7>   DW_AT_sibling     : <0xac2>
 <2><abb>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <abc>   DW_AT_type        : <0x765>
    <ac0>   DW_AT_upper_bound : 3
 <2><ac1>: Abbrev Number: 0
 <1><ac2>: Abbrev Number: 13 (DW_TAG_const_type)
    <ac3>   DW_AT_type        : <0xab2>
 <1><ac7>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <ac8>   DW_AT_type        : <0xac2>
 <1><acc>: Abbrev Number: 5 (DW_TAG_array_type)
    <acd>   DW_AT_type        : <0x79f>
    <ad1>   DW_AT_sibling     : <0xadc>
 <2><ad5>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ad6>   DW_AT_type        : <0x765>
    <ada>   DW_AT_upper_bound : 4
 <2><adb>: Abbrev Number: 0
 <1><adc>: Abbrev Number: 13 (DW_TAG_const_type)
    <add>   DW_AT_type        : <0xacc>
 <1><ae1>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <ae2>   DW_AT_type        : <0xadc>
 <1><ae6>: Abbrev Number: 5 (DW_TAG_array_type)
    <ae7>   DW_AT_type        : <0x78e>
    <aeb>   DW_AT_sibling     : <0xaf6>
 <2><aef>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <af0>   DW_AT_type        : <0x765>
    <af4>   DW_AT_upper_bound : 0
 <2><af5>: Abbrev Number: 0
 <1><af6>: Abbrev Number: 5 (DW_TAG_array_type)
    <af7>   DW_AT_type        : <0x78e>
    <afb>   DW_AT_sibling     : <0xb06>
 <2><aff>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b00>   DW_AT_type        : <0x765>
    <b04>   DW_AT_upper_bound : 92
 <2><b05>: Abbrev Number: 0
 <1><b06>: Abbrev Number: 5 (DW_TAG_array_type)
    <b07>   DW_AT_type        : <0x78e>
    <b0b>   DW_AT_sibling     : <0xb16>
 <2><b0f>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b10>   DW_AT_type        : <0x765>
    <b14>   DW_AT_upper_bound : 14
 <2><b15>: Abbrev Number: 0
 <1><b16>: Abbrev Number: 5 (DW_TAG_array_type)
    <b17>   DW_AT_type        : <0x78e>
    <b1b>   DW_AT_sibling     : <0xb26>
 <2><b1f>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <b20>   DW_AT_type        : <0x765>
    <b24>   DW_AT_upper_bound : 5
 <2><b25>: Abbrev Number: 0
 <1><b26>: Abbrev Number: 16 (DW_TAG_typedef)
    <b27>   DW_AT_name        : (indirect string, offset: 0x15b0ca): SCB_Type
    <b2b>   DW_AT_decl_file   : 2
    <b2c>   DW_AT_decl_line   : 507
    <b2e>   DW_AT_decl_column : 3
    <b2e>   DW_AT_type        : <0x7a4>
 <1><b32>: Abbrev Number: 42 (DW_TAG_union_type)
    <b33>   DW_AT_byte_size   : 4
    <b34>   DW_AT_decl_file   : 2
    <b35>   DW_AT_decl_line   : 1033
    <b37>   DW_AT_decl_column : 9
    <b38>   DW_AT_sibling     : <0xb5d>
 <2><b3c>: Abbrev Number: 24 (DW_TAG_member)
    <b3d>   DW_AT_name        : u8
    <b40>   DW_AT_decl_file   : 2
    <b40>   DW_AT_decl_line   : 1035
    <b42>   DW_AT_decl_column : 22
    <b42>   DW_AT_type        : <0x778>
 <2><b46>: Abbrev Number: 24 (DW_TAG_member)
    <b47>   DW_AT_name        : u16
    <b4b>   DW_AT_decl_file   : 2
    <b4b>   DW_AT_decl_line   : 1036
    <b4d>   DW_AT_decl_column : 22
    <b4d>   DW_AT_type        : <0x789>
 <2><b51>: Abbrev Number: 24 (DW_TAG_member)
    <b52>   DW_AT_name        : u32
    <b56>   DW_AT_decl_file   : 2
    <b56>   DW_AT_decl_line   : 1037
    <b58>   DW_AT_decl_column : 22
    <b58>   DW_AT_type        : <0x79a>
 <2><b5c>: Abbrev Number: 0
 <1><b5d>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <b5e>   DW_AT_type        : <0xb32>
 <1><b62>: Abbrev Number: 23 (DW_TAG_structure_type)
    <b63>   DW_AT_byte_size   : 4096
    <b65>   DW_AT_decl_file   : 2
    <b66>   DW_AT_decl_line   : 1031
    <b68>   DW_AT_decl_column : 9
    <b68>   DW_AT_sibling     : <0xcd3>
 <2><b6c>: Abbrev Number: 2 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0x15b43e): PORT
    <b71>   DW_AT_decl_file   : 2
    <b72>   DW_AT_decl_line   : 1038
    <b74>   DW_AT_decl_column : 6
    <b75>   DW_AT_type        : <0xce3>
    <b79>   DW_AT_data_member_location: 0
 <2><b7a>: Abbrev Number: 2 (DW_TAG_member)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x15b42a): RESERVED0
    <b7f>   DW_AT_decl_file   : 2
    <b80>   DW_AT_decl_line   : 1039
    <b82>   DW_AT_decl_column : 18
    <b83>   DW_AT_type        : <0xce8>
    <b87>   DW_AT_data_member_location: 128
 <2><b88>: Abbrev Number: 6 (DW_TAG_member)
    <b89>   DW_AT_name        : TER
    <b8d>   DW_AT_decl_file   : 2
    <b8e>   DW_AT_decl_line   : 1040
    <b90>   DW_AT_decl_column : 18
    <b91>   DW_AT_type        : <0x79a>
    <b95>   DW_AT_data_member_location: 3584
 <2><b97>: Abbrev Number: 1 (DW_TAG_member)
    <b98>   DW_AT_name        : (indirect string, offset: 0x67af6): RESERVED1
    <b9c>   DW_AT_decl_file   : 2
    <b9d>   DW_AT_decl_line   : 1041
    <b9f>   DW_AT_decl_column : 18
    <ba0>   DW_AT_type        : <0xb06>
    <ba4>   DW_AT_data_member_location: 3588
 <2><ba6>: Abbrev Number: 6 (DW_TAG_member)
    <ba7>   DW_AT_name        : TPR
    <bab>   DW_AT_decl_file   : 2
    <bac>   DW_AT_decl_line   : 1042
    <bae>   DW_AT_decl_column : 18
    <baf>   DW_AT_type        : <0x79a>
    <bb3>   DW_AT_data_member_location: 3648
 <2><bb5>: Abbrev Number: 1 (DW_TAG_member)
    <bb6>   DW_AT_name        : (indirect string, offset: 0xb72da): RESERVED2
    <bba>   DW_AT_decl_file   : 2
    <bbb>   DW_AT_decl_line   : 1043
    <bbd>   DW_AT_decl_column : 18
    <bbe>   DW_AT_type        : <0xb06>
    <bc2>   DW_AT_data_member_location: 3652
 <2><bc4>: Abbrev Number: 6 (DW_TAG_member)
    <bc5>   DW_AT_name        : TCR
    <bc9>   DW_AT_decl_file   : 2
    <bca>   DW_AT_decl_line   : 1044
    <bcc>   DW_AT_decl_column : 18
    <bcd>   DW_AT_type        : <0x79a>
    <bd1>   DW_AT_data_member_location: 3712
 <2><bd3>: Abbrev Number: 1 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x107658): RESERVED3
    <bd8>   DW_AT_decl_file   : 2
    <bd9>   DW_AT_decl_line   : 1045
    <bdb>   DW_AT_decl_column : 18
    <bdc>   DW_AT_type        : <0xcf9>
    <be0>   DW_AT_data_member_location: 3716
 <2><be2>: Abbrev Number: 1 (DW_TAG_member)
    <be3>   DW_AT_name        : (indirect string, offset: 0x67b48): RESERVED4
    <be7>   DW_AT_decl_file   : 2
    <be8>   DW_AT_decl_line   : 1046
    <bea>   DW_AT_decl_column : 18
    <beb>   DW_AT_type        : <0xd09>
    <bef>   DW_AT_data_member_location: 3844
 <2><bf1>: Abbrev Number: 6 (DW_TAG_member)
    <bf2>   DW_AT_name        : LAR
    <bf6>   DW_AT_decl_file   : 2
    <bf7>   DW_AT_decl_line   : 1047
    <bf9>   DW_AT_decl_column : 18
    <bfa>   DW_AT_type        : <0x79a>
    <bfe>   DW_AT_data_member_location: 4016
 <2><c00>: Abbrev Number: 6 (DW_TAG_member)
    <c01>   DW_AT_name        : LSR
    <c05>   DW_AT_decl_file   : 2
    <c06>   DW_AT_decl_line   : 1048
    <c08>   DW_AT_decl_column : 18
    <c09>   DW_AT_type        : <0x79f>
    <c0d>   DW_AT_data_member_location: 4020
 <2><c0f>: Abbrev Number: 1 (DW_TAG_member)
    <c10>   DW_AT_name        : (indirect string, offset: 0x67b52): RESERVED5
    <c14>   DW_AT_decl_file   : 2
    <c15>   DW_AT_decl_line   : 1049
    <c17>   DW_AT_decl_column : 18
    <c18>   DW_AT_type        : <0xb16>
    <c1c>   DW_AT_data_member_location: 4024
 <2><c1e>: Abbrev Number: 1 (DW_TAG_member)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x15b7bc): PID4
    <c23>   DW_AT_decl_file   : 2
    <c24>   DW_AT_decl_line   : 1050
    <c26>   DW_AT_decl_column : 18
    <c27>   DW_AT_type        : <0x79f>
    <c2b>   DW_AT_data_member_location: 4048
 <2><c2d>: Abbrev Number: 1 (DW_TAG_member)
    <c2e>   DW_AT_name        : (indirect string, offset: 0x15b7c1): PID5
    <c32>   DW_AT_decl_file   : 2
    <c33>   DW_AT_decl_line   : 1051
    <c35>   DW_AT_decl_column : 18
    <c36>   DW_AT_type        : <0x79f>
    <c3a>   DW_AT_data_member_location: 4052
 <2><c3c>: Abbrev Number: 1 (DW_TAG_member)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x15b7c6): PID6
    <c41>   DW_AT_decl_file   : 2
    <c42>   DW_AT_decl_line   : 1052
    <c44>   DW_AT_decl_column : 18
    <c45>   DW_AT_type        : <0x79f>
    <c49>   DW_AT_data_member_location: 4056
 <2><c4b>: Abbrev Number: 1 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x15b7cb): PID7
    <c50>   DW_AT_decl_file   : 2
    <c51>   DW_AT_decl_line   : 1053
    <c53>   DW_AT_decl_column : 18
    <c54>   DW_AT_type        : <0x79f>
    <c58>   DW_AT_data_member_location: 4060
 <2><c5a>: Abbrev Number: 1 (DW_TAG_member)
    <c5b>   DW_AT_name        : (indirect string, offset: 0x15b7a8): PID0
    <c5f>   DW_AT_decl_file   : 2
    <c60>   DW_AT_decl_line   : 1054
    <c62>   DW_AT_decl_column : 18
    <c63>   DW_AT_type        : <0x79f>
    <c67>   DW_AT_data_member_location: 4064
 <2><c69>: Abbrev Number: 1 (DW_TAG_member)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x15b7ad): PID1
    <c6e>   DW_AT_decl_file   : 2
    <c6f>   DW_AT_decl_line   : 1055
    <c71>   DW_AT_decl_column : 18
    <c72>   DW_AT_type        : <0x79f>
    <c76>   DW_AT_data_member_location: 4068
 <2><c78>: Abbrev Number: 1 (DW_TAG_member)
    <c79>   DW_AT_name        : (indirect string, offset: 0x15b7b2): PID2
    <c7d>   DW_AT_decl_file   : 2
    <c7e>   DW_AT_decl_line   : 1056
    <c80>   DW_AT_decl_column : 18
    <c81>   DW_AT_type        : <0x79f>
    <c85>   DW_AT_data_member_location: 4072
 <2><c87>: Abbrev Number: 1 (DW_TAG_member)
    <c88>   DW_AT_name        : (indirect string, offset: 0x15b7b7): PID3
    <c8c>   DW_AT_decl_file   : 2
    <c8d>   DW_AT_decl_line   : 1057
    <c8f>   DW_AT_decl_column : 18
    <c90>   DW_AT_type        : <0x79f>
    <c94>   DW_AT_data_member_location: 4076
 <2><c96>: Abbrev Number: 1 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x15b043): CID0
    <c9b>   DW_AT_decl_file   : 2
    <c9c>   DW_AT_decl_line   : 1058
    <c9e>   DW_AT_decl_column : 18
    <c9f>   DW_AT_type        : <0x79f>
    <ca3>   DW_AT_data_member_location: 4080
 <2><ca5>: Abbrev Number: 1 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x15b048): CID1
    <caa>   DW_AT_decl_file   : 2
    <cab>   DW_AT_decl_line   : 1059
    <cad>   DW_AT_decl_column : 18
    <cae>   DW_AT_type        : <0x79f>
    <cb2>   DW_AT_data_member_location: 4084
 <2><cb4>: Abbrev Number: 1 (DW_TAG_member)
    <cb5>   DW_AT_name        : (indirect string, offset: 0x15b04d): CID2
    <cb9>   DW_AT_decl_file   : 2
    <cba>   DW_AT_decl_line   : 1060
    <cbc>   DW_AT_decl_column : 18
    <cbd>   DW_AT_type        : <0x79f>
    <cc1>   DW_AT_data_member_location: 4088
 <2><cc3>: Abbrev Number: 1 (DW_TAG_member)
    <cc4>   DW_AT_name        : (indirect string, offset: 0x15b052): CID3
    <cc8>   DW_AT_decl_file   : 2
    <cc9>   DW_AT_decl_line   : 1061
    <ccb>   DW_AT_decl_column : 18
    <ccc>   DW_AT_type        : <0x79f>
    <cd0>   DW_AT_data_member_location: 4092
 <2><cd2>: Abbrev Number: 0
 <1><cd3>: Abbrev Number: 5 (DW_TAG_array_type)
    <cd4>   DW_AT_type        : <0xb5d>
    <cd8>   DW_AT_sibling     : <0xce3>
 <2><cdc>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <cdd>   DW_AT_type        : <0x765>
    <ce1>   DW_AT_upper_bound : 31
 <2><ce2>: Abbrev Number: 0
 <1><ce3>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <ce4>   DW_AT_type        : <0xcd3>
 <1><ce8>: Abbrev Number: 5 (DW_TAG_array_type)
    <ce9>   DW_AT_type        : <0x78e>
    <ced>   DW_AT_sibling     : <0xcf9>
 <2><cf1>: Abbrev Number: 43 (DW_TAG_subrange_type)
    <cf2>   DW_AT_type        : <0x765>
    <cf6>   DW_AT_upper_bound : 863
 <2><cf8>: Abbrev Number: 0
 <1><cf9>: Abbrev Number: 5 (DW_TAG_array_type)
    <cfa>   DW_AT_type        : <0x78e>
    <cfe>   DW_AT_sibling     : <0xd09>
 <2><d02>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <d03>   DW_AT_type        : <0x765>
    <d07>   DW_AT_upper_bound : 31
 <2><d08>: Abbrev Number: 0
 <1><d09>: Abbrev Number: 5 (DW_TAG_array_type)
    <d0a>   DW_AT_type        : <0x78e>
    <d0e>   DW_AT_sibling     : <0xd19>
 <2><d12>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <d13>   DW_AT_type        : <0x765>
    <d17>   DW_AT_upper_bound : 42
 <2><d18>: Abbrev Number: 0
 <1><d19>: Abbrev Number: 16 (DW_TAG_typedef)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x15b135): ITM_Type
    <d1e>   DW_AT_decl_file   : 2
    <d1f>   DW_AT_decl_line   : 1062
    <d21>   DW_AT_decl_column : 3
    <d21>   DW_AT_type        : <0xb62>
 <1><d25>: Abbrev Number: 44 (DW_TAG_variable)
    <d26>   DW_AT_name        : (indirect string, offset: 0x15ba7e): SystemCoreClock
    <d2a>   DW_AT_decl_file   : 18
    <d2b>   DW_AT_decl_line   : 57
    <d2c>   DW_AT_decl_column : 17
    <d2d>   DW_AT_type        : <0x78e>
    <d31>   DW_AT_external    : 1
    <d31>   DW_AT_declaration : 1
 <1><d31>: Abbrev Number: 5 (DW_TAG_array_type)
    <d32>   DW_AT_type        : <0x79a>
    <d36>   DW_AT_sibling     : <0xd41>
 <2><d3a>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <d3b>   DW_AT_type        : <0x765>
    <d3f>   DW_AT_upper_bound : 3
 <2><d40>: Abbrev Number: 0
 <1><d41>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <d42>   DW_AT_type        : <0xd31>
 <1><d46>: Abbrev Number: 23 (DW_TAG_structure_type)
    <d47>   DW_AT_byte_size   : 840
    <d49>   DW_AT_decl_file   : 6
    <d4a>   DW_AT_decl_line   : 1054
    <d4c>   DW_AT_decl_column : 9
    <d4c>   DW_AT_sibling     : <0xf09>
 <2><d50>: Abbrev Number: 2 (DW_TAG_member)
    <d51>   DW_AT_name        : (indirect string, offset: 0x67af6): RESERVED1
    <d55>   DW_AT_decl_file   : 6
    <d56>   DW_AT_decl_line   : 1056
    <d58>   DW_AT_decl_column : 11
    <d59>   DW_AT_type        : <0x78e>
    <d5d>   DW_AT_data_member_location: 0
 <2><d5e>: Abbrev Number: 2 (DW_TAG_member)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x15afb5): PMCR
    <d63>   DW_AT_decl_file   : 6
    <d64>   DW_AT_decl_line   : 1057
    <d66>   DW_AT_decl_column : 16
    <d67>   DW_AT_type        : <0x79a>
    <d6b>   DW_AT_data_member_location: 4
 <2><d6c>: Abbrev Number: 2 (DW_TAG_member)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x15b7ed): EXTICR
    <d71>   DW_AT_decl_file   : 6
    <d72>   DW_AT_decl_line   : 1058
    <d74>   DW_AT_decl_column : 16
    <d75>   DW_AT_type        : <0xd41>
    <d79>   DW_AT_data_member_location: 8
 <2><d7a>: Abbrev Number: 2 (DW_TAG_member)
    <d7b>   DW_AT_name        : (indirect string, offset: 0x15a4fa): CFGR
    <d7f>   DW_AT_decl_file   : 6
    <d80>   DW_AT_decl_line   : 1059
    <d82>   DW_AT_decl_column : 16
    <d83>   DW_AT_type        : <0x79a>
    <d87>   DW_AT_data_member_location: 24
 <2><d88>: Abbrev Number: 2 (DW_TAG_member)
    <d89>   DW_AT_name        : (indirect string, offset: 0xb72da): RESERVED2
    <d8d>   DW_AT_decl_file   : 6
    <d8e>   DW_AT_decl_line   : 1060
    <d90>   DW_AT_decl_column : 11
    <d91>   DW_AT_type        : <0x78e>
    <d95>   DW_AT_data_member_location: 28
 <2><d96>: Abbrev Number: 2 (DW_TAG_member)
    <d97>   DW_AT_name        : (indirect string, offset: 0x15b3c1): CCCSR
    <d9b>   DW_AT_decl_file   : 6
    <d9c>   DW_AT_decl_line   : 1061
    <d9e>   DW_AT_decl_column : 16
    <d9f>   DW_AT_type        : <0x79a>
    <da3>   DW_AT_data_member_location: 32
 <2><da4>: Abbrev Number: 2 (DW_TAG_member)
    <da5>   DW_AT_name        : (indirect string, offset: 0x15b743): CCVR
    <da9>   DW_AT_decl_file   : 6
    <daa>   DW_AT_decl_line   : 1062
    <dac>   DW_AT_decl_column : 16
    <dad>   DW_AT_type        : <0x79a>
    <db1>   DW_AT_data_member_location: 36
 <2><db2>: Abbrev Number: 2 (DW_TAG_member)
    <db3>   DW_AT_name        : (indirect string, offset: 0x15b725): CCCR
    <db7>   DW_AT_decl_file   : 6
    <db8>   DW_AT_decl_line   : 1063
    <dba>   DW_AT_decl_column : 16
    <dbb>   DW_AT_type        : <0x79a>
    <dbf>   DW_AT_data_member_location: 40
 <2><dc0>: Abbrev Number: 2 (DW_TAG_member)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x15b3b1): PWRCR
    <dc5>   DW_AT_decl_file   : 6
    <dc6>   DW_AT_decl_line   : 1064
    <dc8>   DW_AT_decl_column : 16
    <dc9>   DW_AT_type        : <0x79a>
    <dcd>   DW_AT_data_member_location: 44
 <2><dce>: Abbrev Number: 2 (DW_TAG_member)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x107658): RESERVED3
    <dd3>   DW_AT_decl_file   : 6
    <dd4>   DW_AT_decl_line   : 1065
    <dd6>   DW_AT_decl_column : 16
    <dd7>   DW_AT_type        : <0xf09>
    <ddb>   DW_AT_data_member_location: 48
 <2><ddc>: Abbrev Number: 1 (DW_TAG_member)
    <ddd>   DW_AT_name        : (indirect string, offset: 0x15b94a): PKGR
    <de1>   DW_AT_decl_file   : 6
    <de2>   DW_AT_decl_line   : 1066
    <de4>   DW_AT_decl_column : 17
    <de5>   DW_AT_type        : <0x79a>
    <de9>   DW_AT_data_member_location: 292
 <2><deb>: Abbrev Number: 1 (DW_TAG_member)
    <dec>   DW_AT_name        : (indirect string, offset: 0x67b48): RESERVED4
    <df0>   DW_AT_decl_file   : 6
    <df1>   DW_AT_decl_line   : 1067
    <df3>   DW_AT_decl_column : 16
    <df4>   DW_AT_type        : <0xf19>
    <df8>   DW_AT_data_member_location: 296
 <2><dfa>: Abbrev Number: 6 (DW_TAG_member)
    <dfb>   DW_AT_name        : UR0
    <dff>   DW_AT_decl_file   : 6
    <e00>   DW_AT_decl_line   : 1068
    <e02>   DW_AT_decl_column : 16
    <e03>   DW_AT_type        : <0x79a>
    <e07>   DW_AT_data_member_location: 768
 <2><e09>: Abbrev Number: 6 (DW_TAG_member)
    <e0a>   DW_AT_name        : UR1
    <e0e>   DW_AT_decl_file   : 6
    <e0f>   DW_AT_decl_line   : 1069
    <e11>   DW_AT_decl_column : 16
    <e12>   DW_AT_type        : <0x79a>
    <e16>   DW_AT_data_member_location: 772
 <2><e18>: Abbrev Number: 6 (DW_TAG_member)
    <e19>   DW_AT_name        : UR2
    <e1d>   DW_AT_decl_file   : 6
    <e1e>   DW_AT_decl_line   : 1070
    <e20>   DW_AT_decl_column : 16
    <e21>   DW_AT_type        : <0x79a>
    <e25>   DW_AT_data_member_location: 776
 <2><e27>: Abbrev Number: 6 (DW_TAG_member)
    <e28>   DW_AT_name        : UR3
    <e2c>   DW_AT_decl_file   : 6
    <e2d>   DW_AT_decl_line   : 1071
    <e2f>   DW_AT_decl_column : 16
    <e30>   DW_AT_type        : <0x79a>
    <e34>   DW_AT_data_member_location: 780
 <2><e36>: Abbrev Number: 6 (DW_TAG_member)
    <e37>   DW_AT_name        : UR4
    <e3b>   DW_AT_decl_file   : 6
    <e3c>   DW_AT_decl_line   : 1072
    <e3e>   DW_AT_decl_column : 16
    <e3f>   DW_AT_type        : <0x79a>
    <e43>   DW_AT_data_member_location: 784
 <2><e45>: Abbrev Number: 6 (DW_TAG_member)
    <e46>   DW_AT_name        : UR5
    <e4a>   DW_AT_decl_file   : 6
    <e4b>   DW_AT_decl_line   : 1073
    <e4d>   DW_AT_decl_column : 16
    <e4e>   DW_AT_type        : <0x79a>
    <e52>   DW_AT_data_member_location: 788
 <2><e54>: Abbrev Number: 6 (DW_TAG_member)
    <e55>   DW_AT_name        : UR6
    <e59>   DW_AT_decl_file   : 6
    <e5a>   DW_AT_decl_line   : 1074
    <e5c>   DW_AT_decl_column : 16
    <e5d>   DW_AT_type        : <0x79a>
    <e61>   DW_AT_data_member_location: 792
 <2><e63>: Abbrev Number: 6 (DW_TAG_member)
    <e64>   DW_AT_name        : UR7
    <e68>   DW_AT_decl_file   : 6
    <e69>   DW_AT_decl_line   : 1075
    <e6b>   DW_AT_decl_column : 16
    <e6c>   DW_AT_type        : <0x79a>
    <e70>   DW_AT_data_member_location: 796
 <2><e72>: Abbrev Number: 6 (DW_TAG_member)
    <e73>   DW_AT_name        : UR8
    <e77>   DW_AT_decl_file   : 6
    <e78>   DW_AT_decl_line   : 1076
    <e7a>   DW_AT_decl_column : 16
    <e7b>   DW_AT_type        : <0x79a>
    <e7f>   DW_AT_data_member_location: 800
 <2><e81>: Abbrev Number: 6 (DW_TAG_member)
    <e82>   DW_AT_name        : UR9
    <e86>   DW_AT_decl_file   : 6
    <e87>   DW_AT_decl_line   : 1077
    <e89>   DW_AT_decl_column : 16
    <e8a>   DW_AT_type        : <0x79a>
    <e8e>   DW_AT_data_member_location: 804
 <2><e90>: Abbrev Number: 1 (DW_TAG_member)
    <e91>   DW_AT_name        : (indirect string, offset: 0x15b3e4): UR10
    <e95>   DW_AT_decl_file   : 6
    <e96>   DW_AT_decl_line   : 1078
    <e98>   DW_AT_decl_column : 16
    <e99>   DW_AT_type        : <0x79a>
    <e9d>   DW_AT_data_member_location: 808
 <2><e9f>: Abbrev Number: 1 (DW_TAG_member)
    <ea0>   DW_AT_name        : (indirect string, offset: 0x15b3e9): UR11
    <ea4>   DW_AT_decl_file   : 6
    <ea5>   DW_AT_decl_line   : 1079
    <ea7>   DW_AT_decl_column : 16
    <ea8>   DW_AT_type        : <0x79a>
    <eac>   DW_AT_data_member_location: 812
 <2><eae>: Abbrev Number: 1 (DW_TAG_member)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x15b3ee): UR12
    <eb3>   DW_AT_decl_file   : 6
    <eb4>   DW_AT_decl_line   : 1080
    <eb6>   DW_AT_decl_column : 16
    <eb7>   DW_AT_type        : <0x79a>
    <ebb>   DW_AT_data_member_location: 816
 <2><ebd>: Abbrev Number: 1 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x15b3f3): UR13
    <ec2>   DW_AT_decl_file   : 6
    <ec3>   DW_AT_decl_line   : 1081
    <ec5>   DW_AT_decl_column : 16
    <ec6>   DW_AT_type        : <0x79a>
    <eca>   DW_AT_data_member_location: 820
 <2><ecc>: Abbrev Number: 1 (DW_TAG_member)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x15b3f8): UR14
    <ed1>   DW_AT_decl_file   : 6
    <ed2>   DW_AT_decl_line   : 1082
    <ed4>   DW_AT_decl_column : 16
    <ed5>   DW_AT_type        : <0x79a>
    <ed9>   DW_AT_data_member_location: 824
 <2><edb>: Abbrev Number: 1 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0x15b687): UR15
    <ee0>   DW_AT_decl_file   : 6
    <ee1>   DW_AT_decl_line   : 1083
    <ee3>   DW_AT_decl_column : 16
    <ee4>   DW_AT_type        : <0x79a>
    <ee8>   DW_AT_data_member_location: 828
 <2><eea>: Abbrev Number: 1 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x15b3fd): UR16
    <eef>   DW_AT_decl_file   : 6
    <ef0>   DW_AT_decl_line   : 1084
    <ef2>   DW_AT_decl_column : 16
    <ef3>   DW_AT_type        : <0x79a>
    <ef7>   DW_AT_data_member_location: 832
 <2><ef9>: Abbrev Number: 1 (DW_TAG_member)
    <efa>   DW_AT_name        : (indirect string, offset: 0x15b402): UR17
    <efe>   DW_AT_decl_file   : 6
    <eff>   DW_AT_decl_line   : 1085
    <f01>   DW_AT_decl_column : 16
    <f02>   DW_AT_type        : <0x79a>
    <f06>   DW_AT_data_member_location: 836
 <2><f08>: Abbrev Number: 0
 <1><f09>: Abbrev Number: 5 (DW_TAG_array_type)
    <f0a>   DW_AT_type        : <0x78e>
    <f0e>   DW_AT_sibling     : <0xf19>
 <2><f12>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f13>   DW_AT_type        : <0x765>
    <f17>   DW_AT_upper_bound : 60
 <2><f18>: Abbrev Number: 0
 <1><f19>: Abbrev Number: 5 (DW_TAG_array_type)
    <f1a>   DW_AT_type        : <0x78e>
    <f1e>   DW_AT_sibling     : <0xf29>
 <2><f22>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f23>   DW_AT_type        : <0x765>
    <f27>   DW_AT_upper_bound : 117
 <2><f28>: Abbrev Number: 0
 <1><f29>: Abbrev Number: 16 (DW_TAG_typedef)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x15b833): SYSCFG_TypeDef
    <f2e>   DW_AT_decl_file   : 6
    <f2f>   DW_AT_decl_line   : 1087
    <f31>   DW_AT_decl_column : 3
    <f31>   DW_AT_type        : <0xd46>
 <1><f35>: Abbrev Number: 45 (DW_TAG_structure_type)
    <f36>   DW_AT_byte_size   : 44
    <f37>   DW_AT_decl_file   : 6
    <f38>   DW_AT_decl_line   : 1211
    <f3a>   DW_AT_decl_column : 9
    <f3b>   DW_AT_sibling     : <0xfda>
 <2><f3f>: Abbrev Number: 14 (DW_TAG_member)
    <f40>   DW_AT_name        : CR1
    <f44>   DW_AT_decl_file   : 6
    <f45>   DW_AT_decl_line   : 1213
    <f47>   DW_AT_decl_column : 17
    <f48>   DW_AT_type        : <0x79a>
    <f4c>   DW_AT_data_member_location: 0
 <2><f4d>: Abbrev Number: 2 (DW_TAG_member)
    <f4e>   DW_AT_name        : (indirect string, offset: 0x15b7f4): CSR1
    <f52>   DW_AT_decl_file   : 6
    <f53>   DW_AT_decl_line   : 1214
    <f55>   DW_AT_decl_column : 17
    <f56>   DW_AT_type        : <0x79a>
    <f5a>   DW_AT_data_member_location: 4
 <2><f5b>: Abbrev Number: 14 (DW_TAG_member)
    <f5c>   DW_AT_name        : CR2
    <f60>   DW_AT_decl_file   : 6
    <f61>   DW_AT_decl_line   : 1215
    <f63>   DW_AT_decl_column : 17
    <f64>   DW_AT_type        : <0x79a>
    <f68>   DW_AT_data_member_location: 8
 <2><f69>: Abbrev Number: 14 (DW_TAG_member)
    <f6a>   DW_AT_name        : CR3
    <f6e>   DW_AT_decl_file   : 6
    <f6f>   DW_AT_decl_line   : 1216
    <f71>   DW_AT_decl_column : 17
    <f72>   DW_AT_type        : <0x79a>
    <f76>   DW_AT_data_member_location: 12
 <2><f77>: Abbrev Number: 2 (DW_TAG_member)
    <f78>   DW_AT_name        : (indirect string, offset: 0x15b1cc): CPUCR
    <f7c>   DW_AT_decl_file   : 6
    <f7d>   DW_AT_decl_line   : 1217
    <f7f>   DW_AT_decl_column : 17
    <f80>   DW_AT_type        : <0x79a>
    <f84>   DW_AT_data_member_location: 16
 <2><f85>: Abbrev Number: 2 (DW_TAG_member)
    <f86>   DW_AT_name        : (indirect string, offset: 0x15b42a): RESERVED0
    <f8a>   DW_AT_decl_file   : 6
    <f8b>   DW_AT_decl_line   : 1218
    <f8d>   DW_AT_decl_column : 17
    <f8e>   DW_AT_type        : <0x78e>
    <f92>   DW_AT_data_member_location: 20
 <2><f93>: Abbrev Number: 2 (DW_TAG_member)
    <f94>   DW_AT_name        : (indirect string, offset: 0x15b1b1): D3CR
    <f98>   DW_AT_decl_file   : 6
    <f99>   DW_AT_decl_line   : 1219
    <f9b>   DW_AT_decl_column : 17
    <f9c>   DW_AT_type        : <0x79a>
    <fa0>   DW_AT_data_member_location: 24
 <2><fa1>: Abbrev Number: 2 (DW_TAG_member)
    <fa2>   DW_AT_name        : (indirect string, offset: 0x67af6): RESERVED1
    <fa6>   DW_AT_decl_file   : 6
    <fa7>   DW_AT_decl_line   : 1220
    <fa9>   DW_AT_decl_column : 17
    <faa>   DW_AT_type        : <0x78e>
    <fae>   DW_AT_data_member_location: 28
 <2><faf>: Abbrev Number: 2 (DW_TAG_member)
    <fb0>   DW_AT_name        : (indirect string, offset: 0x15b5a2): WKUPCR
    <fb4>   DW_AT_decl_file   : 6
    <fb5>   DW_AT_decl_line   : 1221
    <fb7>   DW_AT_decl_column : 17
    <fb8>   DW_AT_type        : <0x79a>
    <fbc>   DW_AT_data_member_location: 32
 <2><fbd>: Abbrev Number: 2 (DW_TAG_member)
    <fbe>   DW_AT_name        : (indirect string, offset: 0x15b30d): WKUPFR
    <fc2>   DW_AT_decl_file   : 6
    <fc3>   DW_AT_decl_line   : 1222
    <fc5>   DW_AT_decl_column : 17
    <fc6>   DW_AT_type        : <0x79a>
    <fca>   DW_AT_data_member_location: 36
 <2><fcb>: Abbrev Number: 2 (DW_TAG_member)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x15b7e5): WKUPEPR
    <fd0>   DW_AT_decl_file   : 6
    <fd1>   DW_AT_decl_line   : 1223
    <fd3>   DW_AT_decl_column : 17
    <fd4>   DW_AT_type        : <0x79a>
    <fd8>   DW_AT_data_member_location: 40
 <2><fd9>: Abbrev Number: 0
 <1><fda>: Abbrev Number: 16 (DW_TAG_typedef)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x15ba38): PWR_TypeDef
    <fdf>   DW_AT_decl_file   : 6
    <fe0>   DW_AT_decl_line   : 1224
    <fe2>   DW_AT_decl_column : 3
    <fe2>   DW_AT_type        : <0xf35>
 <1><fe6>: Abbrev Number: 7 (DW_TAG_base_type)
    <fe7>   DW_AT_byte_size   : 8
    <fe8>   DW_AT_encoding    : 4	(float)
    <fe9>   DW_AT_name        : (indirect string, offset: 0xc711e): long double
 <1><fed>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <fee>   DW_AT_byte_size   : 4
    <fee>   DW_AT_type        : <0xff2>
 <1><ff2>: Abbrev Number: 7 (DW_TAG_base_type)
    <ff3>   DW_AT_byte_size   : 1
    <ff4>   DW_AT_encoding    : 8	(unsigned char)
    <ff5>   DW_AT_name        : (indirect string, offset: 0x12b18d): char
 <1><ff9>: Abbrev Number: 13 (DW_TAG_const_type)
    <ffa>   DW_AT_type        : <0xff2>
 <1><ffe>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <fff>   DW_AT_byte_size   : 4
    <fff>   DW_AT_type        : <0xff9>
 <1><1003>: Abbrev Number: 7 (DW_TAG_base_type)
    <1004>   DW_AT_byte_size   : 4
    <1005>   DW_AT_encoding    : 4	(float)
    <1006>   DW_AT_name        : (indirect string, offset: 0x73690): float
 <1><100a>: Abbrev Number: 7 (DW_TAG_base_type)
    <100b>   DW_AT_byte_size   : 8
    <100c>   DW_AT_encoding    : 4	(float)
    <100d>   DW_AT_name        : (indirect string, offset: 0x7e648): double
 <1><1011>: Abbrev Number: 46 (DW_TAG_enumeration_type)
    <1012>   DW_AT_encoding    : 7	(unsigned)
    <1013>   DW_AT_byte_size   : 1
    <1014>   DW_AT_type        : <0x71c>
    <1018>   DW_AT_decl_file   : 7
    <1019>   DW_AT_decl_line   : 40
    <101a>   DW_AT_decl_column : 1
    <101b>   DW_AT_sibling     : <0x1038>
 <2><101f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <1020>   DW_AT_name        : (indirect string, offset: 0x15b876): HAL_OK
    <1024>   DW_AT_const_value : 0
 <2><1025>: Abbrev Number: 17 (DW_TAG_enumerator)
    <1026>   DW_AT_name        : (indirect string, offset: 0x15b778): HAL_ERROR
    <102a>   DW_AT_const_value : 1
 <2><102b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <102c>   DW_AT_name        : (indirect string, offset: 0x15b08e): HAL_BUSY
    <1030>   DW_AT_const_value : 2
 <2><1031>: Abbrev Number: 17 (DW_TAG_enumerator)
    <1032>   DW_AT_name        : (indirect string, offset: 0x15b0e1): HAL_TIMEOUT
    <1036>   DW_AT_const_value : 3
 <2><1037>: Abbrev Number: 0
 <1><1038>: Abbrev Number: 9 (DW_TAG_typedef)
    <1039>   DW_AT_name        : (indirect string, offset: 0x15b87d): HAL_StatusTypeDef
    <103d>   DW_AT_decl_file   : 7
    <103e>   DW_AT_decl_line   : 45
    <103f>   DW_AT_decl_column : 3
    <1040>   DW_AT_type        : <0x1011>
 <1><1044>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1045>   DW_AT_byte_size   : 40
    <1046>   DW_AT_decl_file   : 8
    <1047>   DW_AT_decl_line   : 46
    <1048>   DW_AT_decl_column : 9
    <1048>   DW_AT_sibling     : <0x10cf>
 <2><104c>: Abbrev Number: 3 (DW_TAG_member)
    <104d>   DW_AT_name        : (indirect string, offset: 0x15afba): PLLState
    <1051>   DW_AT_decl_file   : 8
    <1052>   DW_AT_decl_line   : 48
    <1053>   DW_AT_decl_column : 12
    <1054>   DW_AT_type        : <0x78e>
    <1058>   DW_AT_data_member_location: 0
 <2><1059>: Abbrev Number: 3 (DW_TAG_member)
    <105a>   DW_AT_name        : (indirect string, offset: 0x15b95a): PLLSource
    <105e>   DW_AT_decl_file   : 8
    <105f>   DW_AT_decl_line   : 51
    <1060>   DW_AT_decl_column : 12
    <1061>   DW_AT_type        : <0x78e>
    <1065>   DW_AT_data_member_location: 4
 <2><1066>: Abbrev Number: 3 (DW_TAG_member)
    <1067>   DW_AT_name        : (indirect string, offset: 0x15b9f1): PLLM
    <106b>   DW_AT_decl_file   : 8
    <106c>   DW_AT_decl_line   : 54
    <106d>   DW_AT_decl_column : 12
    <106e>   DW_AT_type        : <0x78e>
    <1072>   DW_AT_data_member_location: 8
 <2><1073>: Abbrev Number: 3 (DW_TAG_member)
    <1074>   DW_AT_name        : (indirect string, offset: 0x15b88f): PLLN
    <1078>   DW_AT_decl_file   : 8
    <1079>   DW_AT_decl_line   : 57
    <107a>   DW_AT_decl_column : 12
    <107b>   DW_AT_type        : <0x78e>
    <107f>   DW_AT_data_member_location: 12
 <2><1080>: Abbrev Number: 3 (DW_TAG_member)
    <1081>   DW_AT_name        : (indirect string, offset: 0x15b955): PLLP
    <1085>   DW_AT_decl_file   : 8
    <1086>   DW_AT_decl_line   : 62
    <1087>   DW_AT_decl_column : 12
    <1088>   DW_AT_type        : <0x78e>
    <108c>   DW_AT_data_member_location: 16
 <2><108d>: Abbrev Number: 3 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0x3e20f): PLLQ
    <1092>   DW_AT_decl_file   : 8
    <1093>   DW_AT_decl_line   : 66
    <1094>   DW_AT_decl_column : 12
    <1095>   DW_AT_type        : <0x78e>
    <1099>   DW_AT_data_member_location: 20
 <2><109a>: Abbrev Number: 3 (DW_TAG_member)
    <109b>   DW_AT_name        : (indirect string, offset: 0x15b9f6): PLLR
    <109f>   DW_AT_decl_file   : 8
    <10a0>   DW_AT_decl_line   : 69
    <10a1>   DW_AT_decl_column : 12
    <10a2>   DW_AT_type        : <0x78e>
    <10a6>   DW_AT_data_member_location: 24
 <2><10a7>: Abbrev Number: 3 (DW_TAG_member)
    <10a8>   DW_AT_name        : (indirect string, offset: 0x15b97e): PLLRGE
    <10ac>   DW_AT_decl_file   : 8
    <10ad>   DW_AT_decl_line   : 71
    <10ae>   DW_AT_decl_column : 12
    <10af>   DW_AT_type        : <0x78e>
    <10b3>   DW_AT_data_member_location: 28
 <2><10b4>: Abbrev Number: 3 (DW_TAG_member)
    <10b5>   DW_AT_name        : (indirect string, offset: 0x15ba6c): PLLVCOSEL
    <10b9>   DW_AT_decl_file   : 8
    <10ba>   DW_AT_decl_line   : 73
    <10bb>   DW_AT_decl_column : 12
    <10bc>   DW_AT_type        : <0x78e>
    <10c0>   DW_AT_data_member_location: 32
 <2><10c1>: Abbrev Number: 3 (DW_TAG_member)
    <10c2>   DW_AT_name        : (indirect string, offset: 0x15b62f): PLLFRACN
    <10c6>   DW_AT_decl_file   : 8
    <10c7>   DW_AT_decl_line   : 76
    <10c8>   DW_AT_decl_column : 12
    <10c9>   DW_AT_type        : <0x78e>
    <10cd>   DW_AT_data_member_location: 36
 <2><10ce>: Abbrev Number: 0
 <1><10cf>: Abbrev Number: 9 (DW_TAG_typedef)
    <10d0>   DW_AT_name        : (indirect string, offset: 0x15b8d2): RCC_PLLInitTypeDef
    <10d4>   DW_AT_decl_file   : 8
    <10d5>   DW_AT_decl_line   : 79
    <10d6>   DW_AT_decl_column : 3
    <10d7>   DW_AT_type        : <0x1044>
 <1><10db>: Abbrev Number: 18 (DW_TAG_structure_type)
    <10dc>   DW_AT_byte_size   : 76
    <10dd>   DW_AT_decl_file   : 8
    <10de>   DW_AT_decl_line   : 84
    <10df>   DW_AT_decl_column : 9
    <10df>   DW_AT_sibling     : <0x1166>
 <2><10e3>: Abbrev Number: 3 (DW_TAG_member)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x15b755): OscillatorType
    <10e8>   DW_AT_decl_file   : 8
    <10e9>   DW_AT_decl_line   : 86
    <10ea>   DW_AT_decl_column : 12
    <10eb>   DW_AT_type        : <0x78e>
    <10ef>   DW_AT_data_member_location: 0
 <2><10f0>: Abbrev Number: 3 (DW_TAG_member)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x15ba2f): HSEState
    <10f5>   DW_AT_decl_file   : 8
    <10f6>   DW_AT_decl_line   : 89
    <10f7>   DW_AT_decl_column : 12
    <10f8>   DW_AT_type        : <0x78e>
    <10fc>   DW_AT_data_member_location: 4
 <2><10fd>: Abbrev Number: 3 (DW_TAG_member)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x15b6e2): LSEState
    <1102>   DW_AT_decl_file   : 8
    <1103>   DW_AT_decl_line   : 92
    <1104>   DW_AT_decl_column : 12
    <1105>   DW_AT_type        : <0x78e>
    <1109>   DW_AT_data_member_location: 8
 <2><110a>: Abbrev Number: 3 (DW_TAG_member)
    <110b>   DW_AT_name        : (indirect string, offset: 0x15b1bc): HSIState
    <110f>   DW_AT_decl_file   : 8
    <1110>   DW_AT_decl_line   : 95
    <1111>   DW_AT_decl_column : 12
    <1112>   DW_AT_type        : <0x78e>
    <1116>   DW_AT_data_member_location: 12
 <2><1117>: Abbrev Number: 3 (DW_TAG_member)
    <1118>   DW_AT_name        : (indirect string, offset: 0x15b27b): HSICalibrationValue
    <111c>   DW_AT_decl_file   : 8
    <111d>   DW_AT_decl_line   : 98
    <111e>   DW_AT_decl_column : 12
    <111f>   DW_AT_type        : <0x78e>
    <1123>   DW_AT_data_member_location: 16
 <2><1124>: Abbrev Number: 3 (DW_TAG_member)
    <1125>   DW_AT_name        : (indirect string, offset: 0x15b182): LSIState
    <1129>   DW_AT_decl_file   : 8
    <112a>   DW_AT_decl_line   : 102
    <112b>   DW_AT_decl_column : 12
    <112c>   DW_AT_type        : <0x78e>
    <1130>   DW_AT_data_member_location: 20
 <2><1131>: Abbrev Number: 3 (DW_TAG_member)
    <1132>   DW_AT_name        : (indirect string, offset: 0x15b443): HSI48State
    <1136>   DW_AT_decl_file   : 8
    <1137>   DW_AT_decl_line   : 105
    <1138>   DW_AT_decl_column : 12
    <1139>   DW_AT_type        : <0x78e>
    <113d>   DW_AT_data_member_location: 24
 <2><113e>: Abbrev Number: 3 (DW_TAG_member)
    <113f>   DW_AT_name        : (indirect string, offset: 0x15b557): CSIState
    <1143>   DW_AT_decl_file   : 8
    <1144>   DW_AT_decl_line   : 108
    <1145>   DW_AT_decl_column : 12
    <1146>   DW_AT_type        : <0x78e>
    <114a>   DW_AT_data_member_location: 28
 <2><114b>: Abbrev Number: 3 (DW_TAG_member)
    <114c>   DW_AT_name        : (indirect string, offset: 0x15b584): CSICalibrationValue
    <1150>   DW_AT_decl_file   : 8
    <1151>   DW_AT_decl_line   : 111
    <1152>   DW_AT_decl_column : 12
    <1153>   DW_AT_type        : <0x78e>
    <1157>   DW_AT_data_member_location: 32
 <2><1158>: Abbrev Number: 47 (DW_TAG_member)
    <1159>   DW_AT_name        : PLL
    <115d>   DW_AT_decl_file   : 8
    <115e>   DW_AT_decl_line   : 115
    <115f>   DW_AT_decl_column : 22
    <1160>   DW_AT_type        : <0x10cf>
    <1164>   DW_AT_data_member_location: 36
 <2><1165>: Abbrev Number: 0
 <1><1166>: Abbrev Number: 9 (DW_TAG_typedef)
    <1167>   DW_AT_name        : (indirect string, offset: 0x15b3c7): RCC_OscInitTypeDef
    <116b>   DW_AT_decl_file   : 8
    <116c>   DW_AT_decl_line   : 117
    <116d>   DW_AT_decl_column : 3
    <116e>   DW_AT_type        : <0x10db>
 <1><1172>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1173>   DW_AT_byte_size   : 32
    <1174>   DW_AT_decl_file   : 8
    <1175>   DW_AT_decl_line   : 122
    <1176>   DW_AT_decl_column : 9
    <1176>   DW_AT_sibling     : <0x11e3>
 <2><117a>: Abbrev Number: 3 (DW_TAG_member)
    <117b>   DW_AT_name        : (indirect string, offset: 0x15b7f9): ClockType
    <117f>   DW_AT_decl_file   : 8
    <1180>   DW_AT_decl_line   : 124
    <1181>   DW_AT_decl_column : 12
    <1182>   DW_AT_type        : <0x78e>
    <1186>   DW_AT_data_member_location: 0
 <2><1187>: Abbrev Number: 3 (DW_TAG_member)
    <1188>   DW_AT_name        : (indirect string, offset: 0x15b0b7): SYSCLKSource
    <118c>   DW_AT_decl_file   : 8
    <118d>   DW_AT_decl_line   : 127
    <118e>   DW_AT_decl_column : 12
    <118f>   DW_AT_type        : <0x78e>
    <1193>   DW_AT_data_member_location: 4
 <2><1194>: Abbrev Number: 3 (DW_TAG_member)
    <1195>   DW_AT_name        : (indirect string, offset: 0x15b0d3): SYSCLKDivider
    <1199>   DW_AT_decl_file   : 8
    <119a>   DW_AT_decl_line   : 130
    <119b>   DW_AT_decl_column : 12
    <119c>   DW_AT_type        : <0x78e>
    <11a0>   DW_AT_data_member_location: 8
 <2><11a1>: Abbrev Number: 3 (DW_TAG_member)
    <11a2>   DW_AT_name        : (indirect string, offset: 0x15b4d3): AHBCLKDivider
    <11a6>   DW_AT_decl_file   : 8
    <11a7>   DW_AT_decl_line   : 133
    <11a8>   DW_AT_decl_column : 12
    <11a9>   DW_AT_type        : <0x78e>
    <11ad>   DW_AT_data_member_location: 12
 <2><11ae>: Abbrev Number: 3 (DW_TAG_member)
    <11af>   DW_AT_name        : (indirect string, offset: 0x15b9e2): APB3CLKDivider
    <11b3>   DW_AT_decl_file   : 8
    <11b4>   DW_AT_decl_line   : 136
    <11b5>   DW_AT_decl_column : 12
    <11b6>   DW_AT_type        : <0x78e>
    <11ba>   DW_AT_data_member_location: 16
 <2><11bb>: Abbrev Number: 3 (DW_TAG_member)
